Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/RasterConverter/RasterToLaserForm.*.resx
Languages: cs_cz, de, hu_hu, it

# TpPreview.Text
source: Preview
cs_cz: Náhled
de: Vorschau
hu_hu: Előnézet
it: Anteprima

# TpOriginal.Text
source: Original
cs_cz: Originál
hu_hu: Eredeti
it: Originale

# BtFlipV.ToolTip
source: Flip image vertical
cs_cz: Otočit vertikálně
de: Bild vertikal spiegeln
hu_hu: A kép függőleges tükrözése
it: Specchia verticalmente

# BtFlipH.ToolTip
source: Flip image horizontal
cs_cz: Otočit horizontálně
de: Bild horizontal spiegeln
hu_hu: A kép vízszintes tükrözése
it: Specchia orizzontalmente

# BtRotateCW.ToolTip
source: Rotate 90° clockwise
cs_cz: Otočit o 90° po směru hodinových ručiček
de: Um 90° in Uhrzeigersinn drehen
hu_hu: Forgassa el 90 ° -kal az óramutató járásával megegyező irányban
it: Ruota 90° orario

# BtRotateCCW.ToolTip
source: Rotate 90° counter-clockwise
cs_cz: Otočit o 90° proti směru hodinových ručiček
de: Um 90° gegen den Uhrzeigersinn drehen
hu_hu: Forgassa el 90 ° -kal az óramutató járásával ellentétesen
it: Ruota 90° antiorario

# BtnRevert.ToolTip
source: Revert all changes
cs_cz: Vrátit všechny změny
de: Alle Änderungen zurücksetzen
hu_hu: Minden változtatás visszaállítása
it: Annulla le modifiche

# BtnReverse.ToolTip
source: Invert color
cs_cz: Invertovat barvy
de: Farbe umkehren
hu_hu: Fordított szín
it: Inverti colori

# BtnCrop.ToolTip
source: Crop image
cs_cz: Ořez
de: Bild zuschneiden
hu_hu: Kép vágása
it: Ritaglia

# label6.Text
source: Line Threshold
cs_cz: Prah čar
de: Linien-Schwellenwert
hu_hu: Vonalküszöb
it: Soglia linee

# label7.Text
source: Corner Threshold
cs_cz: Prah rohů
de: Eckschwelle
hu_hu: Sarokküszöb
it: Soglia angoli

# label22.Text
source: Spot Removal
cs_cz: Odstranění skvrn
de: Fleckentfernung
hu_hu: Folt eltávolítása
it: Rimuovi macchie

# label24.Text
source: Optimize
cs_cz: Optimalizace
de: optimieren
hu_hu: Optimalizál
it: Ottimizza

# label23.Text
source: Smoothing
cs_cz: Vyhlazení
de: Glätten
hu_hu: Simítás
it: Arrotonda

# LblFillingQuality.Text
source: Filling Quality
cs_cz: Kvalita výplně
de: Füllqualität
hu_hu: Kitöltési minőség
it: Qualità

# LblFillingLineLbl.Text
source: Lines/mm
cs_cz: čáry/mm
de: Linien/mm
hu_hu: Vonal/mm
it: Linee/mm

# UDDownSample.ToolTip
source: Scale down original image [for HI-Res image]
cs_cz: Zmenšení původního obrázku
de: Skalierung des Originalbildes (für HI-RES-Bild)
hu_hu: Csökkentse az eredeti képet [a HI-Res képhez]
it: Riscala l'immagine [per immagini con risoluzioni troppo elevate]

# lOptimizeFast.Text
source: Optimize Travel
cs_cz: Optimalizace drah
de: Optimieren von Wegen
hu_hu: Optimalizálja a mozgást
it: Ottimizza percorso

# LblGrayscale.Text
source: Grayscale
cs_cz: Odstín šedi
de: Graustufen
hu_hu: Szürkeárnyalatos
it: Algoritmo

# LblRed.Text
source: Red
cs_cz: Červená
de: Rot
hu_hu: Vörös
it: Rosso

# LblBlue.Text
source: Blue
cs_cz: Modrá
de: Blau
hu_hu: Kék
it: Blu

# LblGreen.Text
source: Green
cs_cz: Zelená
de: Grün
hu_hu: Zöld
it: Verde

# label2.Text
source: Brightness
cs_cz: Jas
de: Helligkeit
hu_hu: Fényerősség
it: Luminosità

# label3.Text
source: Contrast
cs_cz: Kontrast
de: Kontrast
hu_hu: Kontraszt
it: Contrasto

# CbThreshold.Text
source: B&&W
cs_cz: Č&B
hu_hu: F&&F
it: Soglia

# label28.Text
source: Resize
cs_cz: Změna velikosti
de: Größe ändern
hu_hu: Átméretezés
it: Scala

# label4.Text
source: White Clip
cs_cz: Práh bílé
de: Weißsättigung
hu_hu: Fehér vágása
it: Bianco

# GbParameters.Text
source: Parameters
cs_cz: Parametry
de: Parameter
hu_hu: Paraméterek
it: Parametri

# CbDirections.ToolTip
source: Engraving direction
cs_cz: Směr gravírování
de: Gravurrichtung
hu_hu: Gravírozási irány
it: Direzione di marcatura

# CbLinePreview.ToolTip
source: Show preview
cs_cz: Náhled
de: Vorschau anzeigen
hu_hu: Előnézet megjelenítése
it: Mostra anteprima

# label5.Text
source: Quality
cs_cz: Kvalita
de: Qualität
hu_hu: Minőség
it: Qualità

# label27.Text
source: Direction
cs_cz: Směr
de: Richtung
hu_hu: Irány
it: Direzione

# label8.Text
source: Lines/mm
cs_cz: čáry/mm
de: Linien/mm
hu_hu: Vonal/mm
it: Linee/mm

# RbCenterline.Text
source: Centerline
cs_cz: Středová čára
de: Mittellinie
hu_hu: Középvonal
it: Linea centrale

# RbVectorize.Text
source: Vectorize!
cs_cz: Vektorizace!
de: Vektorisieren!
it: Vettorizza!

# GbConversionTool.Text
source: Conversion Tool
cs_cz: Zbůsob konverze
de: Umwandlungswerkzeug
hu_hu: Konverziós eszköz
it: Strumento di conversione

# BtnCancel.Text
source: Cancel
cs_cz: Storno
de: abbrechen
hu_hu: Mégsem
it: Annulla

# BtnCreate.Text
source: Next
cs_cz: Další
de: Weiter
hu_hu: Következő
it: Avanti

# $this.Text
source: Import Raster Image
cs_cz: Import rastrového obrázku
de: Rasterbild importieren
hu_hu: Raszteres kép importálása
it: Importa immagine raster

# TBLineThreshold.ToolTip
source: If the spline is not more than this far away from the straight line defined by its endpoints, then output a straight line.
cs_cz: Pokud spline není od přímky definované koncovými body dále, než toto, pak je výsledek přímka.
de: Wenn der Spline nicht weiter ist, als der von durch seine Endpunkte definierten Geraden , dann geben Sie eine Gerade aus.
hu_hu: Ha a spline csak ennél messze van a végpontjai által meghatározott egyenestől, akkor adjon ki egy egyeneset.
it: Imposta la soglia per cui una curva poco pronunciata viene trasformata in una linea.

# label14.Text
source: Filling
cs_cz: Výplň
de: Füllung
hu_hu: Kitöltés
it: Riempimento

# UDFillingQuality.ToolTip
source: Filling quality (lines/mm)
cs_cz: Kvalita (čáry/mm)
de: Füllqualität (Linie/mm)
hu_hu: Kitöltési minőség (vonal/mm)
it: Imposta la risoluzione del riempimento (linee/mm)

# label1.Text
source: Downsampling
cs_cz: Převzorkování
hu_hu: Csökkentett mintavételezés

# CbResize.ToolTip
source: Control resizing mode (Smooth or Hard edges)
cs_cz: Režim změny velikosti (hladké nebo tvrdé hrany)
de: Kontrollierte Größenanpassung (glatte oder harte Ränder)
hu_hu: Átméretezési mód vezérlése (sima vagy kemény élek)
it: Controlla il tipo di scalatura

# CbMode.ToolTip
source: Select color conversion formula
cs_cz: Výběr barvy konverze
de: Farbumwandlungsformel auswählen
hu_hu: Válassza ki a színkonverziós képletet
it: Seleziona la formula di conversione

# UDQuality.ToolTip
source: Set image resolution (lines/mm)
cs_cz: Nastavení rozlišení/kvality obrázku (čáry/mm)
de: Bildauflösung einstellen (Linien/mm)
hu_hu: Állítsa be a képfelbontást (vonal/mm)
it: Imposta la risoluzione di stampa (linee/mm)

# RbDithering.ToolTip
source: Produce grayscale emulated BW image
cs_cz: Vytvoří emulovaný obrázek v odstínech šedi pomocí černobílého obrázku
de: Graustufen erzeugen durch BW Bild Emulation
hu_hu: Készítsen szürkeárnyalatos emulációjú BW képet
it: Produce un immagine BN che simula i toni di grigio

# RbLineToLineTracing.Text
source: Line To Line Tracing
cs_cz: Trasování čára po čáře
de: Linie zu Linie Verfolgung
hu_hu: Sorról sorra leképzés
it: Linea per linea

# RbLineToLineTracing.ToolTip
source: Produce grayscale image
cs_cz: Vytvoří obrázek v odstínech šedi
de: erzeuge Graustufenbild
hu_hu: Készítsen szürkeárnyalatos képet
it: Produce delle linee in toni di grigio

# CbLinePreview.Text
source: Line Preview
cs_cz: Zobrazení čar (drah)
de: Linien Vorschau
hu_hu: Vonal nézet
it: Anteprima linee

# TBCornerThreshold.ToolTip
source: Angle-in-degrees: if a pixel, its predecessors, and its successors meet at an angle smaller than this, it's a corner.
cs_cz: Úhel ve stupních: pokud se pixel, jeho předchůdce a nástupce setkají pod úhlem menším, je to roh.
de: Winkel in Grad: Wenn sich ein Pixel, seine Vorgänger und seine Nachfolger in einem kleineren Winkel als diesem treffen, handelt es sich um eine Ecke.
hu_hu: Szög-fokban: ha egy pixel, elődei és utódjai ennél kisebb szögben találkoznak, akkor ez egy sarok.
it: Angolo in gradi: se tra un pixel, il precedente ed il successivo si forma un angolo più piccolo di questo, viene trovato un angolo.

# GbCenterlineOptions.Text
source: Centerline Options
cs_cz: Možnosti nastavení (středová čára)
de: Mittellinien-Optionen
hu_hu: Középvonal lehetőségek
it: Opzioni linea centrale

# UDSpotRemoval.ToolTip
source: Remove small details
cs_cz: Odstranění malých detailů
de: Kleine Details entfernen
hu_hu: Távolítsa el az apró részleteket
it: Rimuovi tutti i piccoli disturbi

# UDOptimize.ToolTip
source: Optimize path (produce less segments)
cs_cz: Optimalizace drah (vytvoří méně segmentů)
de: Pfad optimieren (weniger Segmente erzeugen)
hu_hu: Optimalizálja az utat (kevesebb szegmenst állítson elő)
it: Ottimizza i tracciati (riduce il numero dei segmenti)

# UDSmoothing.ToolTip
source: Smooth hard edges
cs_cz: Vyhlazení tvrdých hran
de: Glatte harte Kanten
hu_hu: Sima, kemény élek
it: Arrotonda gli spigoli vivi

# CbFillingDirection.ToolTip
source: Enable path filling / set filling direction
cs_cz: Nastavení typu výplně mezi uzavřenými drahami
de: Pfadfüllung aktivieren / Füllrichtung einstellen
hu_hu: Kitöltés engedélyezése / a kitöltési irány beállítása
it: Abilita il riempimento / imposta la direzione

# GbVectorizeOptions.Text
source: Vectorize! Options
cs_cz: Možnosti nastavení (vektorizace)
de: Vektorisieren Optionen
hu_hu: Vectorize! lehetőségek
it: Opzioni Vettorizza!

# GbLineToLineOptions.Text
source: Line To Line Options
cs_cz: Možnosti nastavení (čára po čáře)
de: Linie zu Linie Option
hu_hu: Sorról sorra leképzés lehetőségek
it: Opzioni linea per linea

# RbCenterline.ToolTip
source: Centerline vectorization
cs_cz: Vytvoří vektorizované dráhy středovou čárou
de: Mittellinien-Vektorisierung
hu_hu: Középvonal vektorizáció
it: Vettorizza linea centrale

# RbDithering.Text
source: 1bit BW Dithering
cs_cz: 1bit ČB rozklad
de: 1bit BW Unruhe (zittern)
hu_hu: 1bit FF Színkonverzió
it: Dithering 1bit BN

# RbVectorize.ToolTip
source: Produce vector path
cs_cz: Vytvoří vektorizované dráhy
de: Produzieren Vektoren
hu_hu: Készítsen vektor útvonalat
it: Produce percorsi vettoriali sui bordi

# LblDitherMode.Text
source: Dithering
cs_cz: Rozklad
de: Unruhe
hu_hu: Színkonverzió

# BtnFillingQualityInfo.ToolTip
source: If resolution does not match with stepper pitch some artifacts may appear! Click to compute a reliable resolution...
cs_cz: Pokud rozlišení nesouhlasí s krokem motoru, mohou se objevit artefakty! Kliknutím vypočítáte spolehlivé rozlišení ...
de: Wenn die Auflösung nicht mit der Stepper-Pitch übereinstimmt, können einige Artefakte erscheinen! Klicken Sie, um eine zuverlässige Auflösung zu berechnen ...
hu_hu: Ha a felbontás nem egyezik a léptetőmotor lépéshosszával, hibák jelenhetnek meg! Kattintson egy megbízható felbontás kiszámításához ...
it: Se la risoluzione non coincide con il passo dei motori potrebbero apparire alcuni artefatti. Clicca qui per calcorale una risoluzione attendibile...

# CbThreshold.ToolTip
source: Apply threshold filtering
cs_cz: Použít filtrování prahových hodnot
de: Schwellenfilter anwenden
hu_hu: Alkalmazza a küszöbszűrést
it: Applica un filtro di soglia

# BtnQualityInfo.ToolTip
source: If resolution does not match with stepper pitch some artifacts may appear! Click to compute a reliable resolution...
cs_cz: Pokud rozlišení nesouhlasí s výškou kroku, mohou se objevit artefakty! Kliknutím vypočítáte spolehlivé rozlišení ...
de: Wenn die Auflösung nicht mit der Stepper-Pitch übereinstimmt, können einige Artefakte erscheinen! Klicken Sie, um eine zuverlässige Auflösung zu berechnen ...
hu_hu: Ha a felbontás nem egyezik a léptetőmotor lépéshosszával, hibák jelenhetnek meg! Kattintson egy megbízható felbontás kiszámításához ...
it: Se la risoluzione non coincide con il passo dei motori potrebbero apparire alcuni artefatti. Clicca qui per calcorale una risoluzione attendibile...

# BtnAutoTrim.ToolTip
source: Auto Trim Image
cs_cz: Automatický ořez
de: Bild automatisch zuschneiden
hu_hu: Kép amutomatikus körülvágása
it: Ritaglia automaticamente

# TbPassthroughInfo.Text
source: Passthrough mode leaves the image intact, without any processing by LaserGRBL. The image will be engraver line by line, horizontally, according to the size and DPI resolution contained in file information.
cs_cz: Režim průchodu ponechá obrázk beze změny, bez jakéhokoli zpracování programem LaserGRBL. Obrázek bude gravírován řádek po řádku, vodorovně, podle velikosti a rozlišení DPI podle informacích v souboru.
de: Der Durchreich-Modus lässt das Bild intakt, ohne weitere Verarbeitung durch LaserGRBL. Das Bild wird Linie für Linie eingebrannt, horizontal, entsprehcend der Größe und DPI Auflösung in den Bilddateiinformationen.
hu_hu: A Közvetítő mód érintetlenül hagyja a képet, bárminemű LaserGRBL általi feldolgozás nélkül. A kép vonaltól vonalig lesz gravírozva, vízszintesen, a DPI felbontásnak és a fájl információban szereplő képméretnek megfelelően.

# GbPassthrough.Text
source: Passthrough Options
cs_cz: Možnosti průchodu
de: Durchreich-Optionen
hu_hu: Közvetítő beállítások

# BtnAdaptiveQualityInfo.ToolTip
source: Increase/decrease vectorization quality proportionally to image output size.
cs_cz: Zvýšení / snížení kvality vektorizace úměrně velikosti výstupního obrázku.
de: Vergrössern/Verringern der Vektorisierungsqualität proportional zur Bildausgabegröße.
hu_hu: Vektorizálás minőségének csökkentése/növelése a kép méretével arányosan.
it: Riduci o aumenta la qualità in base alle dimensioni dell'immagine.

# LAdaptiveQuality.Text
source: Adaptive quality
cs_cz: Adaptivní kvalita
de: Adaptive Qualität
hu_hu: Adaptív minőség
it: Qualità adattiva

# RbNoProcessing.Text
source: Passthrough
cs_cz: Průchod
de: Durchreichen
hu_hu: Közvetítés

# RbNoProcessing.ToolTip
source: No Processing (passthrough)
cs_cz: Žádné zpracování (průchod)
de: Keine Verarbeitung/Anpassung (durchreichen)
hu_hu: Nincs feldolgozás (közvetítés)
