Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/RasterConverter/TextToLaserForm.*.resx
Languages: pl_pl, pt_br

# TpPreview.Text
source: Preview
pl_pl: Podgląd zmian
pt_br: Pré-Visualizar

# TpOriginal.Text
source: Original
pl_pl: Oryginał

# BtFlipV.ToolTip
source: Flip image vertical
pl_pl: Odwróć obraz w pionie
pt_br: Girar imagem vertical

# BtFlipH.ToolTip
source: Flip image horizontal
pl_pl: Odwróć obraz w poziomie
pt_br: Girar imagem horizontal

# BtRotateCW.ToolTip
source: Rotate 90° clockwise
pl_pl: Obróć o 90 ° zgodnie z ruchem wskazówek zegara
pt_br: Girar 90º (Sentido horário)

# BtRotateCCW.ToolTip
source: Rotate 90° counter-clockwise
pl_pl: Obróć o 90 ° w lewo
pt_br: Girar 90º (Sentido anti-horário)

# BtnRevert.ToolTip
source: Revert all changes
pl_pl: Cofnij wszystkie zmiany
pt_br: Desfazer todas as alterações

# BtnCrop.ToolTip
source: Crop image
pl_pl: Przytnij obraz
pt_br: Recortar imagem

# BtnReverse.ToolTip
source: Invert color
pl_pl: Odwróć kolor

# BtnAutoTrim.ToolTip
source: Auto Trim Image
pl_pl: Automatyczne przycinanie obrazu

# label6.Text
source: Line Threshold
pl_pl: Próg linii

# label7.Text
source: Corner Threshold
pl_pl: Próg narożny

# TBLineThreshold.ToolTip
source: If the spline is not more than this far away from the straight line defined by its endpoints, then output a straight line.
pl_pl: Jeśli splajn znajduje się nie dalej niż linia prosta zdefiniowana przez punkty końcowe, to wypisz linię prostą.

# TBCornerThreshold.ToolTip
source: Angle-in-degrees: if a pixel, its predecessors, and its successors meet at an angle smaller than this, it's a corner.
pl_pl: Kąt w stopniach: jeśli piksel, jego poprzednicy i jego następcy spotykają się pod kątem mniejszym niż ten, jest to narożnik.

# GbCenterlineOptions.Text
source: Centerline Options
pl_pl: Opcje linii środkowej

# BtnAdaptiveQualityInfo.ToolTip
source: Increase/decrease vectorization quality proportionally to image output size.
pl_pl: Zwiększ/zmniejsz jakość wektoryzacji proporcjonalnie do wielkości wyjściowej obrazu.

# LAdaptiveQuality.Text
source: Adaptive quality
pl_pl: Adaptacyjna jakość

# label22.Text
source: Spot Removal
pl_pl: Usuwanie plam
pt_br: Remover local

# UDSpotRemoval.ToolTip
source: Remove small details
pl_pl: Usuń małe szczegóły
pt_br: Remover pequenos detalhes

# label24.Text
source: Optimize
pl_pl: Optymalizacja
pt_br: Otimizar

# label23.Text
source: Smoothing
pl_pl: Wygładzanie
pt_br: Alisamento

# UDOptimize.ToolTip
source: Optimize path (produce less segments)
pl_pl: Zoptymalizuj ścieżkę (produkuj mniej segmentów)
pt_br: Otimizar caminho (Produz menos segmentos)

# UDSmoothing.ToolTip
source: Smooth hard edges
pl_pl: Gładkie twarde krawędzie
pt_br: Suavizar bordas

# label14.Text
source: Filling
pl_pl: Wypełnienie
pt_br: Preenchimento

# CbFillingDirection.ToolTip
source: Enable path filling / set filling direction
pl_pl: Włącz wypełnianie ścieżek / ustaw kierunek napełniania
pt_br: Habilitar o caminho de arquivamento / Definir o caminho de arquivamento

# LblFillingQuality.Text
source: Filling Quality
pl_pl: Jakość wypełniania
pt_br: Qualidade do preenchimento

# UDFillingQuality.ToolTip
source: Filling quality (lines/mm)
pl_pl: Jakość wypełnienia (linii/mm)
pt_br: Qaualidade de preenchimento (lines/mm)

# LblFillingLineLbl.Text
source: Lines/mm
pl_pl: Linii/mm
pt_br: Linhas/mm

# UDDownSample.ToolTip
source: Scale down original image [for HI-Res image]
pl_pl: Skaluj oryginalny obraz [dla obrazu w wysokiej rozdzielczości]
pt_br: Reduzir escala de imagem (Para imagem de alta definição)

# label1.Text
source: Downsampling
pl_pl: Próbkowanie w dół

# lOptimizeFast.Text
source: Optimize Travel
pl_pl: Optymalizacja przesuwu

# BtnFillingQualityInfo.ToolTip
source: If resolution does not match with stepper pitch some artifacts may appear! Click to compute a reliable resolution...
pl_pl: Jeśli rozdzielczość nie pasuje do kroku, mogą pojawić się niektóre artefakty! Kliknij, aby obliczyć niezawodną rozdzielczość.
pt_br: Se a resolução não corresponder com o passo do motor, a gravação pode não ficar boa! Clique para calcular uma resolução confiável...

# GbVectorizeOptions.Text
source: Vectorize! Options
pl_pl: Wektoryzacja! Opcje
pt_br: Opções do vetor!

# CbResize.ToolTip
source: Control resizing mode (Smooth or Hard edges)
pl_pl: Kontroluj tryb zmiany rozmiaru (gładkie lub twarde krawędzie)

# LblGrayscale.Text
source: Grayscale
pl_pl: Skala szarości
pt_br: Nitidez

# CbMode.ToolTip
source: Select color conversion formula
pl_pl: Wybierz formułę konwersji kolorów
pt_br: Selecione a fórmula de conversão de cores

# LblRed.Text
source: Red
pl_pl: Czerwony
pt_br: Vermelho

# LblBlue.Text
source: Blue
pl_pl: Niebieski
pt_br: Azul

# LblGreen.Text
source: Green
pl_pl: Zielony
pt_br: Verde

# label2.Text
source: Brightness
pl_pl: Jasność
pt_br: Brilho

# label3.Text
source: Contrast
pl_pl: Kontrast
pt_br: Contraste

# CbThreshold.ToolTip
source: Apply threshold filtering
pl_pl: Zastosuj filtrowanie progów
pt_br: Aplicar Limite de filtro

# label28.Text
source: Resize
pl_pl: Zmień rozmiar
pt_br: Modo

# label4.Text
source: White Clip
pl_pl: Wypełnianie
pt_br: Luz

# GbParameters.Text
source: Parameters
pl_pl: Parametry
pt_br: Parâmetros

# CbDirections.ToolTip
source: Engraving direction
pl_pl: Kierunek grawerowania
pt_br: Sentido da gravação

# UDQuality.ToolTip
source: Set image resolution (lines/mm)
pl_pl: Ustaw rozdzielczość obrazu (linii/mm)
pt_br: Setar resolução de imagem (Linhas/mm)

# CbLinePreview.Text
source: Line Preview
pl_pl: Podgląd linii
pt_br: Pré visualizar linha

# CbLinePreview.ToolTip
source: Show preview
pl_pl: Pokaż podgląd
pt_br: Pré-Visualizar

# label5.Text
source: Quality
pl_pl: Jakość
pt_br: Espaço

# label27.Text
source: Direction
pl_pl: Kierunek
pt_br: Sentido

# label8.Text
source: Lines/mm
pl_pl: Linii/mm
pt_br: Linhas/mm

# BtnQualityInfo.ToolTip
source: If resolution does not match with stepper pitch some artifacts may appear! Click to compute a reliable resolution...
pl_pl: Jeśli rozdzielczość nie pasuje do kroku, mogą pojawić się niektóre artefakty! Kliknij, aby obliczyć niezawodną rozdzielczość...
pt_br: Se a resolução não corresponder com o passo do motor, a gravação pode não ficar boa! Clique para calcular uma resolução confiável...

# GbLineToLineOptions.Text
source: Line To Line Options
pl_pl: Opcje linii do linii
pt_br: Opções de Preenchimento

# RbCenterline.Text
source: Centerline
pl_pl: Linia środkowa

# RbCenterline.ToolTip
source: Centerline vectorization
pl_pl: Wektoryzacja linii środkowej

# RbDithering.ToolTip
source: Produce grayscale emulated BW image
pl_pl: Utwórz obraz BW emulowany w skali szarości
pt_br: Produzir imagem preto e branco com emulação de escala de cinza

# RbVectorize.Text
source: Vectorize!
pl_pl: Wektoryzować!
pt_br: Vetor

# RbVectorize.ToolTip
source: Produce vector path
pl_pl: Utwórz ścieżkę wektorową
pt_br: Criar caminho vetorial

# RbLineToLineTracing.Text
source: Line To Line Tracing
pl_pl: Śledzenie linii do linii
pt_br: Rastreamento linha por linha

# RbLineToLineTracing.ToolTip
source: Produce grayscale image
pl_pl: Utwórz obraz w skali szarości
pt_br: Criar escala de cinza a partir da imagem

# GbConversionTool.Text
source: Conversion Tool
pl_pl: Narzędzie do konwersji
pt_br: Ferramenta de conversão

# BtnCancel.Text
source: Cancel
pl_pl: Anuluj
pt_br: Cancelar

# BtnCreate.Text
source: Next
pl_pl: Następny
pt_br: Avançar

# $this.Text
source: Import Raster Image
pl_pl: Importuj obraz rastrowy
pt_br: Importar imagem raster

# CbThreshold.Text
source: B&&W
pt_br: P&&B

# RbDithering.Text
source: 1bit BW Dithering
pt_br: Matiz
