Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/SvgConverter/ConvertSizeAndOptionForm.*.resx
Languages: fr

# GbSpeed.Text
source: Speed
fr: Vitesse

# GbLaser.Text
source: Laser Options
fr: Options du Laser

# GbSaveSettings.Text
source: Saved settings
fr: Configurations sauvegardées

# LblBorderTracing.Text
source: Border Speed
fr: Vitesse de travail

# BtnModulationInfo.ToolTip
source: Grbl support variable output power to produce grayscales. This require your hardware to have a TTL control on laser. Click for more information...
fr: LaserGRBL intègre la modulation de puissance au travers du G-Code "S". Ce la nécessite que votre laser supporte le mode TTL. Cliquez pour plus d'information...

# label18.Text
source: Laser Mode
fr: Laser ON

# BtnOnOffInfo.ToolTip
source: Laser ON: M3 is the standard mode. Grbl v1.1 support a new M4 "Dynamic Laser Power Mode". Laser OFF: only M5 command is supported. Click for more information...
fr: Laser ON: le mode standard est M3. Grbl v1.1 permet un nouveau mode M4 " Mode Puissance Laser Dynamique". Laser OFF: seule la commande M5 est supportée. Cliquez pour plus d'information...

# BtnCancel.Text
source: Cancel
fr: Abandonner

# BtnCreate.Text
source: Create!
fr: Créer !

# BtnDeleteSetting.ToolTip
source: Delete current setting
fr: Supprimer la configuration actuelle

# BtnSaveSetting.ToolTip
source: Save current settings
fr: Sauvegarder une nouvelle configuration

# $this.Text
source: Target image
fr: Image cible
