Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/ConnectLogForm.*.resx
Languages: it

# LblFilename.Text
source: Filename (Engrave)
it: File (Engrave)

# LblProgress.Text
source: Progress
it: Esecuzione

# BtnOpen.ToolTip
source: Open File
it: Apri file

# BtnRunProgram.ToolTip
source: Run Program
it: Esegui il programma

# BtnConnectDisconnect.ToolTip
source: Connect
it: Connetti

# UDLoopCounter.ToolTip
source: Perform multiple passes
it: Esegui più passate

# BtnAbortProgram.ToolTip
source: Abort Program
it: Termina

# LblEmulator.Text
source: Emulator
it: Emulatore

# TxtManualCommand.WaterMark
source: type gcode here
it: scrivi gcode

# LblFilename1.Text
source: Filename 2 (Raster)
it: File 2 (Raster)

# LblFilename2.Text
source: Filename 3 (Cut)
it: File 3 (Cut)
