Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/MainForm.*.resx
Languages: cs_cz, it, zh_tw

# TTLLines.Text
source: Lines:
cs_cz: Řádky:
it: Linee:
zh_tw: 行：

# TTLEstimated.Text
source: Estimated Time:
cs_cz: Odhadnutý čas:
it: Tempo stimato:
zh_tw: 預計工作時間：

# TTLStatus.Text
source: Status:
cs_cz: Stav:
it: Stato:
zh_tw: 狀態：

# MnConnect.Text
source: &Connect
cs_cz: Připojit
it: &Connetti
zh_tw: &連線機器

# MnDisconnect.Text
source: &Disconnect
cs_cz: Odpojit
it: &Disconnetti
zh_tw: &斷開機器

# settingsToolStripMenuItem.Text
source: Settings
cs_cz: Nastavení
it: Impostazioni
zh_tw: 系統設定

# MnExit.Text
source: &Exit
cs_cz: Konec
it: &Esci
zh_tw: &退出

# MnFileOpen.Text
source: &Open File
cs_cz: &Otevřít soubor
it: &Apri file
zh_tw: &打開文件

# MnSaveProgram.Text
source: &Quick Save
cs_cz: Uložit úlohu (program)
it: &Salva (esportazione veloce)
zh_tw: &保存工作NC碼

# MnFileSend.Text
source: Send To &Machine
cs_cz: Spustit úlohu (odeslat do stroje)
it: Invia alla &macchina
zh_tw: &開始雕刻工作

# schemaToolStripMenuItem.Text
source: &Colors
cs_cz: Barvy
it: &Colori
zh_tw: &顏色

# linguaToolStripMenuItem.Text
source: &Language
cs_cz: Jazyk
it: &Lingua
zh_tw: &語言

# MNEnglish.Text
source: English
it: Inglese

# MNItalian.Text
source: Italian
it: Italiano

# MNSpanish.Text
source: Spanish
it: Spagnolo

# MNFrench.Text
source: French
it: Francese

# MNGerman.Text
source: German
it: Tedesco

# MNDanish.Text
source: Danish
it: Danese

# MNBrazilian.Text
source: Portuguese
it: Brasiliano

# russianToolStripMenuItem.Text
source: Russian
it: Russo

# slovakianToolStripMenuItem.Text
source: Slovak
it: Slovacco

# hungarianToolStripMenuItem.Text
source: Hungarian
it: Ungherese

# helpOnLineToolStripMenuItem.Text
source: Help on line
cs_cz: Nápověda on-line
it: Guida in linea
zh_tw: 官網基本操作方式

# openSessionLogToolStripMenuItem.Text
source: Open session log
cs_cz: Otevřít logování
it: Apri log di sessione
zh_tw: 打開工作記錄

# aboutToolStripMenuItem.Text
source: LaserGrbl FAQ
cs_cz: Webová stránka
it: Sito internet
zh_tw: LASERGRBL 常問問題

# chinexeToolStripMenuItem.Text
source: Chinese (simplified)
it: Cinese
zh_tw: 中文(簡體)

# czechToolStripMenuItem.Text
source: Czech
cs_cz: Česky
it: Ceco

# TTTEstimated.Text
source: unknown
cs_cz: neznámý
it: sconosciuto
zh_tw: 其它

# TTTStatus.Text
source: Disconnected
cs_cz: Odpojeno
it: Disconnesso
zh_tw: 斷開連線

# MnUnlock.Text
source: &Unlock
cs_cz: Odemknout
it: &Sblocca
zh_tw: &解鎖

# MnGrblConfig.Text
source: Grbl Configuration
cs_cz: Grbl konfigurace
it: Configura Grbl
zh_tw: Grbl 韌體參數

# MnHotkeys.Text
source: Hotkeys
cs_cz: Horké klávesy
it: Scorciatoie tastiera
zh_tw: 快捷鍵設定

# MnFileAppend.Text
source: &Append File
cs_cz: Přid&at soubor
it: A&ccoda file
zh_tw: &增加文件

# MnReOpenFile.Text
source: &Reload Last File
cs_cz: Načíst znovu poslední soubor
it: &Ricarica ultimo file
zh_tw: &重新載入文件

# MnStartFromPosition.Text
source: Send From &Position
cs_cz: Spustit z &pozice
it: Invia dalla &Posizione
zh_tw: &指定特定代碼行數開始雕刻工作

# MNGrblEmulator.Text
source: &Grbl Emulator
it: Emulatore &Grbl
zh_tw: &Grbl 模擬器

# blueLaserToolStripMenuItem.Text
source: Blue Laser
cs_cz: Modrý laser
it: Laser Blu
zh_tw: 藍色激光

# redLaserToolStripMenuItem.Text
source: Red Laser
cs_cz: Červený laser
it: Laser Rosso
zh_tw: 紅色激光

# darkToolStripMenuItem.Text
source: Dark
cs_cz: Tmavý
it: Tema Scuro
zh_tw: 藍色背景

# hackerToolStripMenuItem.Text
source: Hacker
it: Tema Hacker
zh_tw: 黑藍色背景

# donateToolStripMenuItem.Text
source: Donate!
cs_cz: Dar!
it: Fai una donazione!
zh_tw: 提供贊助費用支持我們！

# polishToolStripMenuItem.Text
source: Polish
it: Polacco

# toolsToolStripMenuItem.Text
source: &Tools
cs_cz: Nástroje
it: &Strumenti
zh_tw: &工具類

# MnMaterialDB.Text
source: Material DB
cs_cz: Materiály (databáze)
it: Database materiali
zh_tw: 材料雕刻工作參數表

# MnAdvancedSave.Text
source: &Save (Advanced Options)
cs_cz: Uložit (rozšířené možnosti)
it: Salva (&Opzioni Avanzate)
zh_tw: &保存工作NC碼（含高級選項）

# nightyToolStripMenuItem.Text
source: Nighty
cs_cz: Noční
it: Tema Notte
zh_tw: 黑色背景

# installCH340DriverToolStripMenuItem.Text
source: Install CH340 Driver
cs_cz: Instalovat CH340 driver
it: Installa driver CH340
zh_tw: 安裝 CH340 USB 驅動程式

# flashGrblFirmwareToolStripMenuItem.Text
source: &Flash Grbl Firmware
it: Scrivi il &Firmware
zh_tw: & Grbl 韌體更新安裝工具

# configurationWizardToolStripMenuItem.Text
source: Configuration &Wizard
cs_cz: Průvodce konfigurací
it: Configurazione &Guidata
zh_tw: &配置與助手

# MnAutoUpdate.Text
source: Auto update
cs_cz: Automatická akutualizace
it: Aggiornamenti automatici
zh_tw: 自動更新

# MnNotifyNewVersion.Text
source: Enable auto update
cs_cz: Povolení automatické aktualizace
it: Abilita aggiornamenti
zh_tw: 激活自動更新

# MnNotifyMinorVersion.Text
source: Notify minor changes
cs_cz: Oznamovat malé změny
it: Notifica aggiornamenti minori
zh_tw: 提醒測試版更新

# MnNotifyPreRelease.Text
source: Notify pre-release
cs_cz: Oznamovat pre-release verze
it: Notifica versioni sperimentali
zh_tw: 通知預發布

# MnCheckNow.Text
source: Check Now!
cs_cz: Zkontrolovat nyní!
it: Controlla ora!
zh_tw: 現在檢查有無更新版！

# activateExtendedLogToolStripMenuItem.Text
source: Activate extended log
cs_cz: Aktivovat rozšířené logování
it: Attiva log esteso
zh_tw: 增加活動記錄

# licenseToolStripMenuItem.Text
source: License
it: Licenza
zh_tw: 版本說明

# MnRunMulti.Text
source: S&yncro Start/Hold/Resume
it: Avvio e pausa s&yncronizzato

# traditionalChineseToolStripMenuItem.Text
source: Chinese (traditional)
it: Cinese (tradizionale)
zh_tw: 中文(繁體)

# greekToolStripMenuItem.Text
source: Greek
it: Greco

# orturSupportGroupToolStripMenuItem.Text
source: Ortur User Group
it: Gruppo Utenti Ortur
zh_tw: ORTUR 用戶組

# orturSupportAndFeedbackToolStripMenuItem.Text
source: Ortur Support and Feedback
it: Supporto Ortur

# orturWebsiteToolStripMenuItem.Text
source: Ortur Website
it: Sito Ortur
zh_tw: ORTUR 網站

# youtubeChannelToolStripMenuItem.Text
source: Youtube Channel
cs_cz: Youtube kanál
it: Canale Youtube
zh_tw: YOUTUBE 頻道

# manualsDownloadToolStripMenuItem.Text
source: Ortur Manuals
it: Manuali
zh_tw: ORTUR 手冊

# firmwareToolStripMenuItem.Text
source: Ortur Firmware
it: Firmware Ortur
zh_tw: ORTUR 韌體

# facebookCommunityToolStripMenuItem.Text
source: LaserGrbl Community
cs_cz: LaserGrbl komunita
it: Comunità di LaserGRBL
zh_tw: LASERGRBL 社群討論

# cadDarkToolStripMenuItem.Text
source: CAD Dark
it: CAD scuro

# cadStyleToolStripMenuItem.Text
source: CAD Style
it: CAD chiaro

# laserUsageStatsToolStripMenuItem.Text
source: Laser Lifespan
it: Utilizzo laser

# lineSizeToolStripMenuItem.Text
source: Line size
it: Dimensione linea

# MnAccuracyTest.Text
source: Accuracy Test
it: Test di precisione

# MnCuttingTest.Text
source: Cutting Test
it: Test di taglio

# MnGenerate.Text
source: Generate
it: Genera

# MnPowerVsSpeed.Text
source: Power vs Speed test
it: Test potenza vs velocità

# MnSaveProject.Text
source: Save Project
it: Salva progetto

# previewToolStripMenuItem.Text
source: Preview
it: Anteprima

# shakeTestToolStripMenuItem.Text
source: Shake Test
it: Test di scuotimento

# showDiagnosticDataToolStripMenuItem.Text
source: Show diagnostic data
it: Mostra la diagnostica

# showExecutedCommandsToolStripMenuItem.Text
source: Show executed commands
it: Mostra comandi eseguiti

# showLaserOffMovementsToolStripMenuItem.Text
source: Show Laser Off movements
it: Mostra movimenti a laser spento

# autosizeModeToolStripMenuItem.Text
source: Auto size mode
it: Modalità dimensionamento automatico

# crossCursorToolStripMenuItem.Text
source: Show cross cursor
it: Mostra cursore a croce

# drawingAreaToolStripMenuItem.Text
source: Drawing area
it: Area di disegno

# movingAreaToolStripMenuItem.Text
source: Moving area
it: Area di movimento

# showBoundingBoxToolStripMenuItem.Text
source: Show bounding box
it: Mostra contorni del disegno

# TTLBuffer.Text
source: Buffer
zh_tw: 緩衝

# fileToolStripMenuItem.Text
source: &File
cs_cz: Soubor
zh_tw: &文件

# MnGrblReset.Text
source: &Reset
zh_tw: &復位

# MnGoHome.Text
source: &Homing
cs_cz: Domů
zh_tw: &回原點
