Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/ResumeJobForm.*.resx
Languages: el_gr, hu_hu

# CbRestoreWCO.Text
source: Home @
el_gr: Αρχή @

# BtnOK.Text
source: OK
el_gr: ΟΚ

# BtnCancel.Text
source: Cancel
el_gr: Ακύρωση
hu_hu: Mégsem

# CbRedoHoming.Text
source: Redo Homing [$H]
el_gr: Επανεκτέλεση επαναφοράς [$Η]

# RbSomeLines.Text
source: Resume some lines before the stop
el_gr: Συνεχίστε μερικές γραμμές πριν από το σταμάτημα
hu_hu: Folytassa a megállás előtti sortól

# RbFromSpecific.Text
source: Resume from specific line
el_gr: Συνέχιση από συγκεκριμένη γραμμή
hu_hu: Folytatás az adott sorról

# RbFromBeginning.Text
source: Start again from beginning [safe]
el_gr: Ξεκινήστε ξανά από την αρχή [ασφαλής]
hu_hu: Indítsa újra az elejétől [biztonságos]

# RbFromSent.Text
source: Resume from last command sent
el_gr: Συνέχιση από την τελευταία εντολή που στάλθηκε
hu_hu: Folytatás az utolsó elküldött parancsról

# LblBrief.Text
source: LaserGRBL can start this job again from beginning or try to resume from last known position. As it is not always possible to determine the best restart position we let you to take the final decision. Last speed, power and laser state are recovered automatically.
el_gr: Το LaserGRBL μπορεί να ξεκινήσει ξανά αυτήν την εργασία από την αρχή ή να προσπαθήσει να συνεχίσει από την τελευταία γνωστή θέση. Καθώς δεν είναι πάντα δυνατό να προσδιορίσετε την καλύτερη θέση επανεκκίνησης, σας αφήνουμε να λάβετε την τελική απόφαση. Η τελευταία ταχύτητα, η ισχύς και η κατάσταση λέιζερ ανακτώνται αυτόματα.
hu_hu: A LaserGRBL újraindíthatja ezt a munkát a kezdetektől, vagy megpróbálhatja folytatni az utolsó ismert pozícióból. Mivel a legjobb újraindítási helyzet meghatározása automatikusan nem mindig lehetséges, hagyjuk, hogy Ön meghozza a végső döntést. Az utolsó sebesség, teljesítmény és lézerállapot automatikusan helyreáll.

# LblCause.Text
source: Cause:
el_gr: Αιτία:
hu_hu: Ok:

# TxtCause.Text
source: Unknown
el_gr: Άγνωστο
hu_hu: Ismeretlen

# LblDetected.Text
source: LaserGRBL detected last job was not completed!
el_gr: Το LaserGRBL που εντοπίσε οτι δεν είχε ολοκληρωθεί η τελευταία εργασία!
hu_hu: A LaserGRBL észlelte, hogy a legutolsó munka nem fejeződött be!

# $this.Text
source: Resume Job
el_gr: Συνέχιση
hu_hu: Folytassa a munkát

# label2.Text
source: Line #
hu_hu: Sor #

# label1.Text
source: Options
hu_hu: Opciók
