Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/SettingsForm.*.resx
Languages: cs_cz, hu_hu, nl_nl, pl_pl, pt_br, zh_tw

# label1.Text
source: LaserGRBL use power modulation through G-Code "S command" to produce grayscale tones. Your laser must support TTL control connected to arduino PIN D11. If not, please disable PWM support.
cs_cz: Váš kontrolér laseru musí podporovat TTL řízení na pinu D11 Arduina. Pokud tomu tak není, prosím deaktivujte podporu PWM.
hu_hu: A LaserGRBL az energiamodulációt használja a G-kód "S parancs" segítségével szürkeárnyalatos tónusok előállításához. A lézerének támogatnia kell az arduino D11-es kimenetéhez csatlakoztatott TTL vezérlést. Ha nem, kérjük, tiltsa le a PWM támogatást.
nl_nl: LaserGRBL gebruikt vermogensmodulatie via G-Code "S command" om grijswaardentinten te produceren. Uw laser moet TTL-besturing ondersteunen die is aangesloten op arduino PIN D11. Zo niet, schakel dan PWM-ondersteuning uit.
pl_pl: LaserGRBL wykorzystuje modulację mocy za pomocą „polecenia S” G-Code w celu uzyskania odcieni szarości. Twój laser musi obsługiwać sterowanie TTL podłączone do arduino PIN D11. Jeśli nie, wyłącz obsługę PWM.
pt_br: LaserGRBL usa energia modulada em seu G-Code "Comando S" para produzir gravação em tons de cinza Seu laser precisa suportar o controle TTL conectado ao pino D11 do arduino. Caso contrário, desabilite a opção "Suporte PWM"
zh_tw: LaserGRBL使用G代碼“ S命令”進行功率調節，以獲得圖像具有灰階深淺效果。(圖像需要有正確的黑白對比調整，才會有比較好的效果) 您的激光器必須支持連接到arduino PIN D11的TTL控制。 PWM與TTL均可以調節灰階，S值比例輸出。 如果沒有這個功能輸出，請禁用PWM支持。

# groupBox1.Text
source: Header
cs_cz: Záhlaví
hu_hu: Fejléc
nl_nl: Kop
pl_pl: Nagłówek
pt_br: Cabeçalho
zh_tw: 開始前工作G代碼

# $this.Text
source: Settings
cs_cz: Nastavení
hu_hu: Beállítások
nl_nl: Instellingen
pl_pl: Ustawienia
pt_br: Configurações
zh_tw: 設定

# CBSupportPWM.Text
source: Support PWM
cs_cz: Podpora PWM
hu_hu: PWM támogatás
nl_nl: Ondersteuning PWM
pl_pl: Wsparcie PWM
pt_br: Suporte PWM
zh_tw: 支持PWM

# BtnCancel.Text
source: Cancel
cs_cz: Storno
hu_hu: Mégsem
nl_nl: Annuleren
pl_pl: Anuluj
pt_br: Cancelar
zh_tw: 取消

# BtnSave.Text
source: Save
cs_cz: Uložit
hu_hu: Mentés
nl_nl: Opslaan
pl_pl: Zapisz
pt_br: Salvar
zh_tw: 保存

# label4.Text
source: Streaming Mode: [Default Buffered] - Buffered: optimize commands streaming filling up grbl receive buffer [recommended] - Synchronous: wait for the execution of each command prior to send the very next command [slower but safer] - RepeatOnError: same as Synchronous but repeat commands if detect error [experimental]
cs_cz: Režim streamování: [výchozí Bufferování] - Bufferování: optimalizace streamování příkazů podle zaplnění grbl přijímacího bufferu [doporučeno] - Synchronní: čekání na provedení každého příkazu, než se odešle další příkaz [pomalejší, ale bezpečnější] - Opakování při chybě: stejné jako Synchronní režim, ale příkazy jsou opakovány pokud je detekována chyba [experimentální]
hu_hu: Streaming mód: [Alapértelmezetten Buffered] - Buffered: a grbl fogadási puffert kitöltő adatfolyamok optimalizálása [ajánlott] - Synchronous: várja meg az egyes parancsok végrehajtását, mielőtt elküldi a következő parancsot [lassabb, de biztonságosabb] - RepeatOnError: ugyanaz, mint a szinkron, de ismételje meg a parancsokat, ha hibát észlel [kísérleti]
nl_nl: Streamingmodus: [Standaard gebufferd] - Gebufferd: optimaliseer commando's streaming vullen grbl ontvangen buffer [aanbevolen] - Synchroon: wacht op de uitvoering van elk commando voordat u het volgende commando verzendt [langzamer maar veiliger] - RepeatOnError: hetzelfde als Synchronous maar herhaal commando's als detectie fout [experimenteel]
pl_pl: Tryb przesyłania strumieniowego: [domyślne buforowanie] - Buforowanie: optymalizacja strumieniowania poleceń zgodnie z wypełnieniem grbl bufora odbiorczego [zalecane] - Synchroniczny: poczekaj na wykonanie każdego polecenia przed wysłaniem następnego polecenia [wolniej, ale bezpieczniej] - Powtarzanie błędów: tak samo jak w trybie synchronicznym, ale polecenia są powtarzane, jeśli zostanie wykryty błąd [eksperymentalne]
pt_br: Modo de streaming: [Buffer padrão] - Bufferizado: otimiza o streaming de comandos preenchendo o buffer de recebimento grbl [recomendado] - Síncrono: aguarde a execução de cada comando antes de enviar o próximo comando [mais lento, mas mais seguro] - RepeatOnError: o mesmo que Synchronous, mas repete comandos se detectar erro [experimental]
zh_tw: 串流模式：[默認-緩衝 Buffering] -緩衝 Buffering：根據grbl接收緩衝區的填充來優化命令流傳輸[推薦] -同步 Synchronous：在發送下一個命令之前，等待每個命令執行[速度較慢但更安全] -重複錯誤 Repat On Error：與同步模式相同，但是如果檢測到錯誤，則重複命令[實驗性]

# label3.Text
source: Connection Protocol: - UsbSerial: is the most common protocol. Should be used if your engraver is connected to USB or COM port. - UsbSerial2: an alternative implementation of USB serial to bypass Microsoft SerialPort issues - Telnet: if you have a WiFi-Telnet bridge. Communication is implemented like a simple telnet client-server. - LaserWebESP8266: support WiFi connection via WebSocket. Compatible with LaserWeb-ESP8266 software.
cs_cz: Protokol připojení: - UsbSerial, ije nejběžnější protokol. Měl by být použit, pokud je Váš stroj připojen přes USB nebo COM port. - Telnet, pokud máte WiFi-Telnet bridge. Komunikace je implementována jako jednoduchý telnet klient-server. - LaserWebESP8266 podporuje WiFi připojení via WebSocket. Kompatibilní s LaserWeb-ESP8266 software.
hu_hu: Csatlakozási protokoll: - Az UsbSerial, a leggyakoribb protokoll. Ezt akkor kell használni, ha a gravír USB vagy COM porthoz van csatlakoztatva. - Telnet, ha van WiFi-Telnet híd. A kommunikáció úgy történik, mint egy egyszerű telnet kliens-szerver. - A LaserWebESP8266 támogatja a WiFi kapcsolatot a WebSocket-en keresztül. Kompatibilis a LaserWeb-ESP8266 szoftverrel.
nl_nl: Verbindingsprotocol: - UsbSerial: is het meest voorkomende protocol. Moet worden gebruikt als uw graveur is aangesloten op een USB- of COM-poort. - UsbSerial2: een alternatieve implementatie van USB seriële om Microsoft SerialPort problemen te omzeilen - Telnet: als je een WiFi-Telnet brug hebt. Communicatie wordt geïmplementeerd als een eenvoudige telnet client-server. - LaserWebESP8266: ondersteuning WiFi-verbinding via WebSocket. Compatibel met LaserWeb-ESP8266 software.
pl_pl: Protokół połączenia: - USB Serial, jest najczęstszym protokołem. Należy stosować, jeśli engraver jest podłączony do portu USB lub COM. - Telnet, jeśli masz most Wifi-Telnet. Komunikacja jest realizowana jako prosty klient-serwer Telnet. - LaserWebESP8266 obsługuje połączenie Wi-Fi przez WebSocket. Kompatybilny z oprogramowaniem LaserWeb-ESP8266.
pt_br: Protocolo de conexão: - UsbSerial: é o protocolo mais comum. Deve ser usado se o gravador estiver conectado à porta USB ou COM. - UsbSerial2: uma implementação alternativa de serial USB para contornar os problemas do Microsoft SerialPort - Telnet: se você tiver uma ponte WiFi-Telnet. A comunicação é implementada como um simples cliente-servidor telnet. - LaserWebESP8266: suporta conexão Wi-Fi via WebSocket. Compatível com o software LaserWeb-ESP8266.
zh_tw: 連接協議：[默認-UsbSerial] -UsbSerial，是最常見的協議。應使用如果你的雕刻機連接到USB或串口。 -Telnet，如果您有一個WiFi登錄橋接。通信實現像一個簡單的客戶端-服務器的telnet。 -LaserWebESP8266，支持WIFI連接通過WebSocket。與laserweb-esp8266軟件兼容。 -Emulator，是一個模擬已連接GRBL機器，假設已連接機器已可工作下的連接模式。

# label6.Text
source: Threading Mode: UltraFast, Fast, Quiet, Slow. [Default Fast] This setting affect the speed of sending thread and the frequency of status report request. Set slower values if you are experiencing issues.
cs_cz: Threading Mode: [výchozí UltraFast] Ultrarychlý, Rychlý, Klidný, Pomalý. Toto nastavení ovlivňuje rychlost odesílání a frekvenci žádostí o hlášení stavu zařízení. Pokud máte problémy, nastavte pomalejší hodnoty.
hu_hu: Processz mód: UltraFast, Fast, Quiet, Slow. [Alapértelmezett Fast] Ez a beállítás befolyásolja a program processz küldésének sebességét és az állapotjelentés kérésének gyakoriságát. Állítson be lassabb értékeket, ha problémák merülnek fel.
nl_nl: Threading-modus: ultrasnel, snel, stil, langzaam. [Standaard snel] Deze instelling is van invloed op de snelheid van het verzenden van threads en de frequentie van statusrapportaanvragen. Stel langzamere waarden in als u problemen ondervindt.
pl_pl: Tryb wątków: Ultraszybki, Szybki, Spokojny, Wolny [domyślny Fast]. To ustawienie wpływa na szybkość i częstotliwość żądań raportowania stanu urządzenia. Jeśli masz problemy, ustaw wolniejsze wartości.
pt_br: Modo de Envio: UltraFast, Fast, Quiet, Slow. [Rápido Padrão] Essa configuração afeta a velocidade do encadeamento de envio e a frequência da solicitação do relatório de status. Defina valores mais lentos se estiver enfrentando problemas.
zh_tw: 線程模式：[默認-超快速 Fast] 瘋狂Insane，超快速UltraFast，快速Fast，平靜Quiet，慢速Slow。 此設置影響報告設備狀態的請求的速度和頻率。 如果有問題，請設置較慢的值。

# CbIssueDetector.Text
source: Issue detector
cs_cz: Detekce problémů
hu_hu: Problémaérzékelő
nl_nl: Probleem detector
pl_pl: Wykrywanie problemu
pt_br: Detetor de problemas
zh_tw: 問題檢測

# CbHardReset.Text
source: Hard Reset [DTR+RTS]
nl_nl: Harde reset [DTR+RTS]
pl_pl: Twardy reset [DTR + RTS]
pt_br: Reset de Hardware [DTR+RTS]
zh_tw: 硬體重置 [DTR+RTS]

# label7.Text
source: LaserGRBL can detect issues and warn the user providing info about how to solve them. If disabled all the issues are silently managed without warning.
cs_cz: LaserGRBL může detekovat problémy a varovat uživatele poskytnutím informací o tom, jak je vyřešit. Pokud je deaktivováno, jsou všechny problémy řešeny tiše bez varování.
hu_hu: A LaserGRBL képes észlelni a problémákat, és figyelmeztetheti a felhasználót, hogy információval szolgáljon azok megoldásáról. Ha le van tiltva, akkor az összes problémát figyelmeztetés nélkül csendesen kezeli.
nl_nl: LaserGRBL kan problemen detecteren en de gebruiker waarschuwen door informatie te verstrekken over hoe ze op te lossen. Als deze optie is uitgeschakeld, worden alle problemen zonder waarschuwing op de achtergrond behandeld.
pl_pl: LaserGRBL może wykryć problemy i ostrzegać użytkownika, dostarczając informacji o tym, jak je rozwiązać. Jeśli wyłączone, wszystkie problemy są rozwiązywane w trybie cichym bez ostrzeżenia.
pt_br: O LaserGRBL pode detetar problemas e ajudar o usuário fornecendo informações de como resolve-las. Se desabilitado todos os problemas serão gerenciado silenciosamente sem alarmes.
zh_tw: LaserGRBL可以通過提供有關如何解決問題的信息來檢測問題並警告用戶.。 如果禁用，則所有問題都將以靜默方式解決，而不會發出警告。

# CbSoftReset.Text
source: Soft Reset [Ctrl-X]
nl_nl: Zachte reset [Ctrl-X]
pl_pl: Miękki reset [Ctrl-X]
pt_br: Reset do Programa [Ctrl-X]
zh_tw: 軟件重置 [Ctrl-X]

# label2.Text
source: If enabled LaserGRBL send a soft-reset when the connection to grbl is opened.
cs_cz: Pokud je aktivováno, LaserGRBL odešle soft-reset při otevření připojení k grbl.
hu_hu: Ha engedélyezve van, a LaserGRBL küldjön soft reset-et, amikor a grbl-kapcsolat megnyílik.
nl_nl: Indien ingeschakeld, stuurt LaserGRBL een soft-reset wanneer de verbinding met grbl wordt geopend.
pl_pl: Po aktywacji LaserGRBL wysyła miękki reset, gdy połączenie z grbl jest otwarte.
pt_br: se habilitado o LaserGRBL envia um reset de programa quando a conecção ao GRBL é aberta.
zh_tw: 如果啟用，則在打開與GRBL的連接時，LaserGRBL將發送軟件重置。

# label8.Text
source: If enabled LaserGRBL send a hard-reset when the connection to grbl is opened. [Position is lost!]
cs_cz: Pokud je aktivováno, LaserGRBL odešle hard-reset při otevření připojení k grbl [ztráta pozice!].
hu_hu: Ha engedélyezve van, a LaserGRBL küldjön egy hard-reset-et, amikor a grbl-kapcsolat megnyílik. [Pozíció elveszik!]
nl_nl: Indien ingeschakeld, stuurt LaserGRBL een harde reset wanneer de verbinding met grbl wordt geopend. [Positie is verloren!]
pl_pl: Po aktywacji LaserGRBL wysyła twardy reset, gdy połączenie z grbl jest otwarte. [Utrata pozycji!].
pt_br: se habilitado o LaserGRBL envia um reset de hardware quando a conecção ao GRBL é aberta. (a Posição é perdida!)
zh_tw: 如果啟用，則在打開與GRBL的連接時，LaserGRBL將發送硬體重置。 [失去您的位置！]。

# label9.Text
source: Firmware type - Grbl: the awesome firmware for which LaserGRBL was developed for. - Smoothie [experimental]: support has been added recently and is not fully tested. - Marlin [experimental]: support has been added recently and is not fully tested. - VigoWork [experimental]: support for VG-L7x model that is non grbl-standard.
cs_cz: Typ firmware kontroléru - Grbl: skvělý firmware, pro který byl LaserGRBL vyvinut. - Smoothie [experimentálně]: podpora byla přidána nedávno a není plně otestována.
hu_hu: Firmware típus - Grbl: a fantasztikus firmware, amelyre a LaserGRBL-t kifejlesztették. - Smoothie [kísérleti]: a támogatást nemrégiben adták hozzá, és még nem tesztelték teljesen.
nl_nl: Firmware type - Grbl: de geweldige firmware waarvoor LaserGRBL is ontwikkeld. - Smoothie [experimenteel]: ondersteuning is onlangs toegevoegd en is niet volledig getest. - Marlin [experimenteel]: ondersteuning is onlangs toegevoegd en is niet volledig getest. - VigoWork [experimenteel]: ondersteuning voor VG-L7x model dat niet grbl-standaard is.
pl_pl: Typ oprogramowania kontrolera - Grbl: świetne oprogramowanie, dla którego opracowano LaserGRBL. - Smoothie [eksperymentalne]: Wsparcie zostało dodane niedawno i nie zostało w pełni przetestowane.
pt_br: Tipo de firmware - Grbl: o incrível firmware para o qual o LaserGRBL foi desenvolvido. - Smoothie [experimental]: o suporte foi adicionado recentemente e não foi totalmente testado. - Marlin [experimental]: o suporte foi adicionado recentemente e não foi totalmente testado. - VigoWork [experimental]: suporte para modelo VG-L7x que não é padrão grbl.
zh_tw: 主機板韌體類型：[默認-Grbl 韌體] -Grbl：專門為LaserGRBL開發的出色韌體。 -Smoothie [實驗性]：支持最近已添加，尚未經過全面測試。 -Marlin：馬林韌體支持尚處於早期階段。假定LaserGRBL能夠與Marlin通信，但是LaserGRBL生成的gcode可能不是100％兼容的。

# CbQueryDI.Text
source: Query $I at connect
pt_br: Busca $l ao conectar

# label46.Text
source: In enabled LaserGRBL send a $I command and detect some information from the machine (i.e. the machine rx buffer size). Please do not disable this feature.
pt_br: Se ativado o LaserGRBL envia um comando $I e detecta algumas informações da máquina (ou seja, o tamanho do buffer rx da máquina). Por favor, não desabilite este recurso.

# TpHardware.Text
source: Protocol
cs_cz: Protokol
hu_hu: Protokoll
pl_pl: Protokół
pt_br: Protocolo
zh_tw: 協議

# label5.Text
source: By default LaserGRBL produces engraving lines in both travel directions of the laser head. Some tests have shown that this mode (which is faster) produces lower quality results. If the maximum marking quality is desired, activate this option.
cs_cz: Standardně LaserGRBL vytváří dráhy pro gravírování v obou směrech pohybu laserové hlavy. Některé testy ukázaly, že tento režim (který je rychlejší) přináší nižší kvalitu výsledků. Pokud je požadována maximální kvalita, aktivujte tuto možnost.
hu_hu: Alapértelmezés szerint a lézerfej mindkét menetirányában gravíroz. Egyes tesztek azt mutatták, hogy ez a mód (ami gyorsabb) alacsonyabb minőséget eredményez. Ha a maximális minõséget kívánja, aktiválja ezt az opciót.
nl_nl: Standaard produceert LaserGRBL graveerlijnen in beide rijrichtingen van de laserkop. Sommige tests hebben aangetoond dat deze modus (die sneller is) resultaten van lagere kwaliteit oplevert. Als de maximale markeringskwaliteit gewenst is, activeert u deze optie.
pl_pl: Domyślnie LaserGRBL tworzy ścieżki grawerowania w obu kierunkach głowicy laserowej. Niektóre testy wykazały, że ten tryb (który jest szybszy) daje wyniki niższej jakości. Jeśli wymagana jest maksymalna jakość wykonania, aktywuj tę opcję.
pt_br: Por padrão, o LaserGRBL produz linhas de gravação em ambas as direções de deslocamento do cabeçote do laser. Alguns testes mostraram que este modo (que é mais rápido) produz resultados de qualidade inferior. Se desejar a máxima qualidade de gravação, ative esta opção.
zh_tw: 默認情況下(未勾選欄位)，LaserGRBL在激光頭的兩個方向上創建雕刻路徑。 一些測試顯示了此模式（雕刻速度更快）會導致雕刻質量較低的結果。 如果需要大型圖片雕刻，請勾選欄位，以便加速工作。

# CbUnidirectional.Text
source: Unidirectional Engraving
cs_cz: Gravírování v jednom směru
hu_hu: Egyirányú gravírozás
nl_nl: Unidirectioneel graveren
pl_pl: Grawerowanie jednokierunkowe
pt_br: Gravação Unidirecional
zh_tw: 單向雕刻

# CbHiRes.Text
source: HiRes Filling
cs_cz: HiRes rozlišení
hu_hu: HiRes kitöltés
nl_nl: HiRes Vulling
pl_pl: Wypełnianie HiRes
pt_br: Preenchimento de alta resolução (HiRes)
zh_tw: 高解析度的填充

# label22.Text
source: The max resolution available in LaserGRBL is 20 lines/mm (about 500dpi) that is high enough for most user. If you need higher resolution you can enable "HiRes" and remove this limit. Be careful: LaserGRBL will need many more resources!
cs_cz: Maximální dostupné rozlišení v LaserGRBL je 20 řádků/mm (asi 500 dpi), které je pro většinu uživatelů dostatečné. Pokud potřebujete vyšší rozlišení, můžete povolit „HiRes“ a odstranit tento limit. Buďte opatrní: LaserGRBL bude potřebovat mnohem více zdrojových prostředků!
hu_hu: A LaserGRBL maximális felbontása 20 vonal/mm (kb 500dpi), ami elég a legtöbb felhasználónak. Ha szeretne nagyobb felbontást, engedélyezheti a "HiRes" kitöltést, amely eltávolítja a fenti korlátozást. Figyelem: A LaserGRBL így jóval több erőforrást igényel!
nl_nl: De maximale resolutie die beschikbaar is in LaserGRBL is 20 lijnen / mm (ongeveer 500 dpi) die hoog genoeg is voor de meeste gebruikers. Als u een hogere resolutie nodig hebt, kunt u "HiRes" inschakelen en deze limiet verwijderen. Let op: LaserGRBL heeft veel meer middelen nodig!
pl_pl: Maksymalna rozdzielczość dostępna w LaserGRBL wynosi 20 linii/mm (około 500 dpi), co jest wystarczającą wartością dla większości użytkowników. Jeśli potrzebujesz wyższej rozdzielczości, możesz włączyć „HiRes” i usunąć ten limit. Uwaga: LaserGRBL będzie potrzebował znacznie więcej zasobów!
pt_br: A resolução máxima disponível no LaserGRBL é de 20 linhas/mm (cerca de 500 dpi) que é alta o suficiente para a maioria dos usuários. Se precisar de uma resolução mais alta, você pode habilitar "HiRes" e remover esse limite. Cuidado: o LaserGRBL precisará de muito mais recursos!
zh_tw: LaserGRBL中可用的最大解析度為20行/毫米（約500 dpi），對於大多數用戶而言已足夠。 如果需要更高的解析度，可以勾選這個欄位，進而解除這個限制。 注意：LaserGRBL程式將需要更多運算資源！

# CbDisableSkip.Text
source: Disable G0 fast skip
cs_cz: Zakázat G0 (rychlý pohyb)
hu_hu: G0 gyors átugrás kikapcsolása
nl_nl: Schakel G0 fast skip uit
pt_br: Desabilita o G0 movimento rápido

# label39.Text
source: By default LaserGRBL use G0 - rapid movement - to skip white parts of your jobs. This speed up the engraving process but it can result in inaccurate positioning with disappointing results. It is usually possible to improve the results by correctly setting the maximum acceleration and speed values ($ 120,121,122 and $ 110,111,112) in the grbl configuration. If you disable this feature LaserGRBL will use G1 linear movement at the same job speed, with the result that all the engraving process is done at the same speed. This will slow down the process, but can drammatically improve the result where others approacs fails.
cs_cz: Ve výchozím nastavení LaserGRBL používá G0 (rychlý pohyb) k přeskočení prázdných míst. To urychlí proces gravírování, ale může vést k nepřesnostem a neuspokojivým výsledkům. To je obvykle možné vylepšit správným nastavením hodnot maximálního zrychlení a rychlosti ($ 120,122,122 a $ 110,111,112) v konfiguraci grbl. Pokud tuto funkci deaktivujete, použije LaserGRBL G1 (lineární pohyb se stejnou rychlostí), takže celý proces gravírování se provede stejnou rychlostí. To proces zpomalí, ale může dramaticky zlepšit výsledek tam, kdy jinak dochází k selhání.
hu_hu: Alapértelmezetten a LaserGRBL G0 - gyors mozgás - parancsot használ a fehér területek átugrására. Ez felgyorsítja a gravírozási folyamatot, de pontatlan pozícionálást eredményezhet, családást keltő végeredménnyel. Általában javítható a végeredmény a helyes maximális gyorsulás és sebesség beállításával ($ 120,121,122 és $ 110,111,112) a grbl beállításokban Ha kikapcsolja, a LaserGRBL a G1 lineáris mozgást fogja használni a munka beállított sebességével, ami eredménye képpen a gravírozási folyamat azonos sebességen fog végbemenni. Ez lelassítja a folyamatot, de nagyban javítja a végeredményt, ha más beállítás nem segít.
nl_nl: Standaard gebruikt LaserGRBL G0 - snelle verplaatsing - om witte delen in uw job over te slaan. Dit versnelt het engraveren maar het kan zorgen voor onnauwkeurige positionering met teleurstellende resultaten. Het is meestal mogelijk om de resultaten te verbeteren door het juist in stellen van de maximale versnelling en snelheids waardes ($ 120, 121, 122 en $ 110, 111, 112) in de grbl configuratie. Als je deze functionaiteit uitzet zal LaserGRBL de G1 lineaire verplaatsing gebruiken met dezelfde job snelheid. Dit zal het proces vertragen, maar kan het resultaat dramatisch verbeteren waar andere mogelijkheden mislukken.
pt_br: Por padrão, o LaserGRBL usa G0 - movimento rápido - para pular partes brancas de seus trabalhos. Isso acelera o processo de gravação, mas pode resultar em posicionamento impreciso com resultados decepcionantes. Geralmente é possível melhorar os resultados definindo corretamente os valores máximos de aceleração e velocidade ($ 120.121.122 e $ 110.111.112) na configuração grbl. Se você desativar esse recurso, o LaserGRBL usará o movimento linear G1 na mesma velocidade de trabalho, resultando em todo o processo de gravação na mesma velocidade. Isso retardará o processo, mas pode melhorar drasticamente o resultado onde outras abordagens falham.

# CbDisableBoundWarn.Text
source: Disable boundary warn
cs_cz: Zakázat kontrolu okrajů
hu_hu: Határfigyelmeztetés kikapcsolása
nl_nl: Begrenzings waarschuwingen uitschakelen
pt_br: Desativar aviso de limite

# label40.Text
source: LaserGRBL will warn you if you are going to create a job bigger then your engraver workspace. Set this flag if you don't whant this safety control.
cs_cz: LaserGRBL Vás upozorní, pokud se chystáte vytvořit úlohu větší, než je pracovní plocha pro gravírování. Zvolte tuto možnost, pokud bezpečnostní kontrolu nechcete.
hu_hu: A LaserGRBL figyelmeztetni fogja, ha olyan munkát hoz létre, amely nagyobb, mint a gravírozója munkaterülete. Állítsa be, ha nem szeretné ezt a biztonsági figyelmeztetést.
nl_nl: LaserGRBL zal u waarschuwen als u een job creeert die groter is dan de engraver werkruimte. Zet deze vlag indien je deze veiligheidscontrole niet wilt.
pt_br: O LaserGRBL irá avisá-lo se você for criar um trabalho maior que o espaço de trabalho do gravador. Defina este sinalizador se você não quiser este controle de segurança.

# TpRasterImport.Text
source: Raster import
cs_cz: Import rastrových obrázků
hu_hu: Raszter import
pl_pl: Import rastrowy
pt_br: Importação de Raster
zh_tw: 柵格導入

# label43.Text
source: Starting from version 4.6.1 LaserGRBL uses a better approximation algorithm of bezier curves, capable of returning more accurate results. Disable this option if you prefer to use the old algorithm.
nl_nl: Vanaf 4.6.1 zal LaserGrbl een beter benaderings algoritme gebruiken met Bezier krommingen, die nauwkeurigere resultaten teruggeven. Schakel deze optie uit als u de voorkeur hebt voor de oude algoritme.
pt_br: A partir da versão 4.6.1, o LaserGRBL usa um algoritmo de aproximação melhor das curvas bezier, capaz de retornar resultados mais precisos. Desative esta opção se preferir usar o algoritmo antigo.

# CbSmartBezier.Text
source: Smart Bezier
nl_nl: Slimme Bezier
pt_br: Bezier Inteligente

# TpVectorImport.Text
source: Vector import
pt_br: Importação de vetores
