Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/SettingsForm.*.resx
Languages: cs_cz, hu_hu, nl_nl, pl_pl, pt_br, zh_tw

# label10.Text
source: Without "Continuous Jog" when jog button is pressed LaserGRBL send Jog request with settled speed and movement; and the jog is fully executed to the final position. If you enable "Continuous Jog" jogging is sent with mouse-down and aborted/interrupted on mouse-up, so you can do approximative positioning but in a very comfortable way. NOTE: "Continuous Jog" only work with Grbl v1.1 or later, and require table size is correctily configured in Grbl Configuration (Menu "Grbl" -> "Grbl Configuration" $130, $131, $132)
hu_hu: A "Folyamatos Mozgatás" nélkül, amikor megnyomja a jog gombot, a LaserGRBL elküldi a Jog kérést állandó sebességgel és mozgással; és a mozgatás a végső pozícióig történik. Ha engedélyezi a "Folyamatos Mozgatás" funkciót, akkor a mozgatás az egérbomb lenyomásakor indul, és az egérgomb elengedésekor megszakításra kerül, így csak hozzávetőleges pozícionálást végezhet, de nagyon kényelmes módon. MEGJEGYZÉS: A "Folyamatos Mozgatás" csak a Grbl v1.1 vagy újabb verziókkal működik, és a táblázat méretét helyesen kell beállítani a Grbl Konfigurációban ("Grbl" menü>> "Grbl konfiguráció" $130, $131 $132)
nl_nl: Zonder "Continuous Jog" wanneer de jog-knop wordt ingedrukt, verzendt LaserGRBL een Jog-verzoek met vaste snelheid en beweging; en het joggen wordt volledig uitgevoerd naar de eindpositie. Als u "Continu joggen" inschakelt, wordt het joggen verzonden met de muis naar beneden en afgebroken/onderbroken wanneer de muis omhoog gaat, zodat u benaderende positionering kunt doen, maar op een zeer comfortabele manier. OPMERKING: "Continuous Jog" werkt alleen met Grbl v1.1 of hoger en vereist dat de tabelgrootte correct is geconfigureerd in Grbl-configuratie (menu "Grbl" ->; "Grbl-configuratie" $ 130, $ 131, $ 132)
pl_pl: Bez „Continuous Jog” po naciśnięciu przycisku jog LaserGRBL wysyła żądanie Jog z ustaloną prędkością i ruchem; i impuls jest w pełni wykonywany do pozycji końcowej. Jeśli włączysz opcję „Continuous Jog”, impulsowanie jest wysyłane z myszą w dół i przerywane / przerywane z myszą w górę, więc możesz wykonywać przybliżone pozycjonowanie, ale w bardzo wygodny sposób. UWAGA: „Continuous Jog” działa tylko z Grbl v1.1 lub nowszym i wymaga poprawnego skonfigurowania rozmiaru tabeli w konfiguracji Grbl (Menu „Grbl” -> „Konfiguracja Grbl” $130, $131, $132)
pt_br: Sem "Movimento Contínuo" quando o botão mover é pressionado LaserGRBL envia solicitação de Mover com velocidade e movimento estabelecidos; e o movimento é totalmente executado até a posição final. Se você habilitar "Movimento Contínuo", o movimento é enviado com o mouse para baixo e abortado/interrompido com o mouse para cima, para que você possa fazer um posicionamento aproximado, mas de uma maneira muito confortável. NOTA: "Movimento Contínuo" só funciona com Grbl v1.1 ou posterior, e requer que o tamanho da mesa esteja configurado corretamente na Configuração Grbl (Menu "Grbl" -> "Configuração Grbl" $ 130, $ 131, $ 132)
zh_tw: "移動XY電機"按鍵-在視窗左下角，顯示8個方位的箭頭。 -沒有啟用情況：“連續移動XY電機”選項，則按下滑鼠左鍵(對應移動方向按鈕)不論不放開或放開，XY電機將按"LaserGRBL"設定的速度和運動，發送一次移動命令，並立即停止，再按第二次者再移動固定距離； -啟用情況：“連續移動XY電機”選項，則按下滑鼠左鍵(對應移動方向按鈕)不放開時會持續移動 / 放開後者按時間長短立即停止，不用重複點擊按鈕，因此您可以以非常方便的方式執行近似定位。電機脈沖完全執行到終點位置(達到最大行程設定而停)。 注意：“連續點動”僅適用於Grbl v1.1或更高版本，並且需要在Grbl韌體參數中設定正確的最大行程(軟體限位-如X軸A點到B點最大移動距離)。 如： 主選單Grbl >Grbl 韌體參數>>( $ 130，$ 131，$ 132)

# label11.Text
source: LaserGRBL is not designed to support Z axis, but if you have a 3axis hardware maybe you could find this option usefull.
cs_cz: LaserGRBL není navržen pro ovládání osy Z, ale pokud máte stroj se 3 osami, může být tato možnost užitečná.
hu_hu: A LaserGRBL-nek nem célja a Z tengely támogatása, de ha van 3 tengelyes hardvere, talán hasznosnak találhatja ezt a beállítást.
nl_nl: LaserGRBL is niet ontworpen om de Z-as te ondersteunen, maar als je hardware met 3 assen hebt, zou je deze optie misschien handig kunnen vinden.
pl_pl: LaserGRBL nie jest przeznaczony do sterowania osią Z, ale jeśli masz maszynę z 3 osiami, być może ta opcja byłaby przydatna.
pt_br: O LaserGRBL não foi projetado para suportar o eixo Z, mas se você tiver um hardware de 3 eixos, talvez possa achar esta opção útil.
zh_tw: LaserGRBL並非旨在控制Z軸，但是如果您的機器具有3軸，則此選項直接控制Z軸。 請確認主選單Grbl >Grbl 韌體參數>> $ 3-方向，$ 102-步數，$ 112-最大速率，$ 122-加速度等設定值 (z軸不建議太快移動速度)

# CbEnableZJog.Text
source: Show Z up/down control
cs_cz: Zobrazení ovládání osy Z (nahoru a dolů)
hu_hu: Mutassa a Z fel / le irányítását
nl_nl: Toon Z op/neer control
pl_pl: Wyświetlacz sterowania osi Z (góra i dół)
pt_br: Mostra o controle Z cima/baixo
zh_tw: 顯示Z軸 向上 / 向下 控件介面

# CbContinuosJog.Text
source: Continuos Jog
cs_cz: Plynulé polohování
hu_hu: Folyamatos Mozgatás
nl_nl: Continue Jog
pl_pl: Płynne pozycjonowanie
pt_br: Movimento Contínuo
zh_tw: 連續移動XY電機

# CbClickNJog.Text
source: Click 'n Jog
cs_cz: Polohování poklepáním (click 'n jog)
hu_hu: Katt-és-menj
nl_nl: Klik en Jog
pt_br: Clicar e Mover

# label41.Text
source: With "click 'n jog" enabled a double-click on preview surface will jog to the click position.
cs_cz: Je-li povoleno „click 'n jog“, poklepáním na plochu náhledu bude provedeno polohování na pozici kliknutí.
hu_hu: A katt-és-menj funkció engedélyezésével dupla kattintással az előnézeten a gép a kattintott pozícióra mozdul.
nl_nl: Met "klik en Jog" ingeschakeld zal een dubbel-klikop het voorbeeld scherm springen naar de klik positie
pt_br: Com "Clicar e Mover" ativado, um clique duplo na superfície de visualização irá deslocar para a posição do clique.

# TpJogControl.Text
source: Jog control
cs_cz: Polohování
hu_hu: Mozgás Irányítás
nl_nl: Jog controle
pl_pl: Pozycjonowanie
pt_br: Controle de Movimento
zh_tw: 定位

# label20.Text
source: Time OFF: after this cooling time LaserGRBL will send a resume command to continue engraving job.
cs_cz: Čas VYP: po této době odešle LaserGRBL příkaz pro pokračování úlohy (gravírování).
hu_hu: Kikapcsolt idő: e hűtési idő után a LaserGRBL folytatja a parancsot a gravírozás folytatása érdekében.
nl_nl: Tijd UIT: na deze afkoeltijd stuurt LaserGRBL een hervattingscommando om door te gaan met graveren.
pl_pl: Czas Wyłączenia (WYŁ): po tym czasie chlodzenia LaserGRBL wyśle polecenie wznowienia, aby kontynuować zadanie.
pt_br: Tempo OFF: após esse tempo de resfriamento, o LaserGRBL enviará um comando de retomada para continuar o trabalho de gravação
zh_tw: 關閉時間（OFF）：需要暫停冷卻的時間經過之後，LaserGRBL發送命令以繼續工作（雕刻）。

# label12.Text
source: Some laser diodes can heat-up to much if they run for a long time at the highest power. To prevent diode overheating and increase your laser lifetime you can add some automatic cooling-down cycles that insert some pause during engraivng process. If Auto Cooling is enabled LaserGRBL will send automatic "feed hold" and "job resume" according with ON-OFF timing configuration.
cs_cz: Některé laserové diody se mohou zahřát příliš mnoho, pokud pracují dlouhou dobu na nejvyšší výkon. Chcete-li zabránit přehřátí a prodloužit životnost laseru, může být automaticky vložen cyklus pro přerušení úlohy, během této pauzy dojde k ochlazení. Pokud je aktivováno automatické chlazení, LaserGRBL odešle automaticky příkazy pro "pozastavení" a "obnovení" podle nastavení časů ZAP-VYP.
hu_hu: Néhány lézerdióda nagyon felmelegszik, ha hosszú ideig a legnagyobb teljesítmény mellett működik. A dióda túlmelegedésének megakadályozása és a lézer élettartamának növelése érdekében hozzáadhat néhány automatikus lehűtési ciklust, amelyek néhány szünetet tartalmaznak a gravírozás során. Ha az automatikus hűtés engedélyezve van, a LaserGRBL automatikusan "feed hold" -ot és "job resume" -ot küld az ON-OFF időzítés konfigurációjának megfelelően.
nl_nl: Sommige laserdiodes kunnen te veel opwarmen als ze lange tijd op het hoogste vermogen werken. Om oververhitting van de diode te voorkomen en de levensduur van uw laser te verlengen, kunt u enkele automatische afkoelcycli toevoegen die een pauze inlassen tijdens het graveerproces. Als Auto Cooling is ingeschakeld, stuurt LaserGRBL automatische "feed hold" en "job hervat" volgens de ON-OFF timingconfiguratie.
pl_pl: Niektóre diody laserowe mogą stać się zbyt gorące, jeśli będą działać z maksymalną mocą przez pewien czas. Aby zapobiec przegrzaniu i przedłużyć żywotność lasera, cykl przerywania pracy można wstawić automatycznie, a podczas tej przerwy nastąpi chłodzenie. Jeśli aktywowane jest automatyczne chłodzenie, LaserGRBL automatycznie wyśle ​​polecenia „pauza” i „wznów” zgodnie z ustawionym czasem WŁ.-WYŁ.
pt_br: Alguns diodos laser podem esquentar muito se funcionarem por muito tempo na potência máxima. Para evitar o superaquecimento do diodo e aumentar a vida útil do laser, você pode adicionar alguns ciclos de resfriamento automático que inserem alguma pausa durante o processo de gravação. Se o Resfriamento Automático estiver ativado, o LaserGRBL enviará automaticamente "retenção de alimentação" e "retomada do trabalho" de acordo com a configuração de tempo ON-OFF.
zh_tw: 如果某些激光二極管在最大功率下運行一段時間，可能會變得過熱。 為防止過熱為了延長激光器的使用壽命，可以自動插入循環暫停周期。 並且在此中斷期間將發生冷卻。 這循環暫停周期將按整個工作時間，進行分割自動插入“暫停”和“恢復”命令。 如果激活了自動冷卻功能，LaserGRBL將根據設置自動發送“暫停”和“恢復”命令，並含有"時間"的"開"與"關"

# label13.Text
source: Time ON: this is the maximum time that Laser will stay on during engraving process. After this time LaserGRBL will send an automatic feed hold to cool down the laser.
cs_cz: Čas ZAP: maximální doba, po kterou zůstane laser zapnutý. Po uplynutí této doby LaserGRBL odešle automaticky příkaz pro přerušení úlohy, aby vychladl laser.
hu_hu: Bekapcsolt idő: ez a maximális idő, ameddig a lézer bekapcsol a gravírozás során. Ez idő elteltével a LaserGRBL automatikus várakozást küld a lézer lehűléséhez.
nl_nl: Tijd AAN: dit is de maximale tijd dat de laser aan blijft tijdens het graveerproces. Na deze tijd stuurt LaserGRBL een automatische invoerstop om de laser af te koelen.
pl_pl: Czas Włączenia (WŁ): jest to maksymalny czas, przez który laser pozostanie włączony podczas procesu grawerowania. Po tym czasie LaserGRBL automatycznie wysyła polecenie przerwania zadania w celu schłodzenia lasera.
pt_br: Tempo LIGADO: é o tempo máximo que o Laser ficará ligado durante o processo de gravação. Após esse período, o LaserGRBL enviará uma retenção de alimentação automática para resfriar o laser.
zh_tw: 開啟時間（ON）：雕刻過程中激光保持連續工作發光最長的時間。 在這段時間之後，LaserGRBL自動發送作業暫停命令以冷卻激光器。

# CbAutoCooling.Text
source: Enable auto cooling
cs_cz: Automatické chlazení
hu_hu: Automatikus hűtés engedélyezése
nl_nl: Automatische koeling inschakelen
pl_pl: Włącz Automatyczne chłodzenie
pt_br: Habilita auto resfriamento
zh_tw: 開啟自動冷卻

# label14.Text
source: On
cs_cz: Zap
hu_hu: Be
nl_nl: Aan
pl_pl: WŁ.
pt_br: Ligado
zh_tw: 開啟

# label16.Text
source: sec
cs_cz: s
hu_hu: másodperc
pl_pl: sek
pt_br: seg
zh_tw: 秒

# label18.Text
source: Off
cs_cz: Vyp
hu_hu: Ki
nl_nl: Uit
pl_pl: WYŁ.
pt_br: Desligado
zh_tw: 關閉

# label19.Text
source: sec
cs_cz: s
hu_hu: másoperc
pl_pl: sek
pt_br: seg
zh_tw: 秒

# label21.Text
source: Warning: this feature will work only with grbl versions > v1.1 with "laser mode" enabled. If you use auto-cooling with older grbl version (or with laser mode disabled) the laser will not turn off during pauses and burns holes in your work!
cs_cz: Upozornění: tato funkce je funkční pouze u verze grbl > v1.1 s povoleným "laser režimem". Pokud používáte automatické chlazení se starší verzí grbl (nebo s deaktivovaným "laser režimem"), laser se během pauzy nevypne a vypálí díru ve Vaší matrici!
hu_hu: Figyelem: ez a szolgáltatás csak a grbl v1.1 vagy újabb verziók esetén működik, ha a „laser mode” engedélyezve van. Ha önhűtést használ egy régebbi grbl verzióval (vagy letiltott lézer üzemmóddal), a lézer szünetek alatt nem kapcsol ki és lyukakat éget a munkájában!
nl_nl: Waarschuwing: deze functie werkt alleen met grbl-versies > v1.1 met "lasermodus" ingeschakeld. Als u automatische koeling gebruikt met een oudere grbl-versie (of met lasermodus uitgeschakeld), wordt de laser niet uitgeschakeld tijdens pauzes en brandt gaten in je werk!
pl_pl: Uwaga: ta funkcja działa tylko z wersją grbl; > v1.1 z włączonym „trybem laserowym”. Jeśli użyjesz automatycznego chłodzenia ze starszą wersją grbl (lub z wyłączonym „trybem laserowym”), laser nie wyłączy się podczas przerw i wypali dziurę w twojej pracy!
pt_br: Aviso: este recurso funcionará apenas com versões grbl > v1.1 com "modo laser" ativado. Se você usar o resfriamento automático com a versão grbl mais antiga (ou com o modo laser desativado), o laser não será desligado durante as pausas e queima buracos em seu trabalho!
zh_tw: 注意：此功能僅適用於grbl版本； > v1.1，並啟用“激光模式M4(非M3模式)”。 M4設定請至主選單Grbl>>Grbl 韌體參數設定>>$32 設定 1 (開啟M4支持) 如果您在舊版本的grbl（或關閉了“激光模式”）下使用自動冷卻，激光在休息期間不會關閉，並會在您的工作中燒一個洞！

# LblWarnOrturAC.Text
source: Ortur User: Ortur Firmware (all version up to 137) has a bug on the machining resume that prevents properly using the auto-cooling function. Please do not use Automatic Cooling with Ortur engraver until a new firmware is released.
cs_cz: Uživatelé Ortur: Firmware Ortur (všechny verze až do 137) obsahuje chybu v obnovení, která znemožňuje správné použití funkce automatického chlazení. Nepoužívejte automatické chlazení se zařízením Ortur, dokud nebude vydán nový firmware.
hu_hu: Ortur felhasználók: Az Ortur Firmware (egészen a 137-es verzióig) hibásan folytatja a megkezdett munkát, ezáltal az Automata hűtés nem működik megfelelően. Kérem, ne használja az Automatikus hűtés funkciót, amíg egy javított firmware el nem készül.
nl_nl: Ortur-gebruiker: Ortur-firmware (alle versies tot 137) heeft een bug in de bewerkingshervatting die het correct gebruik van de auto-koelfunctie verhindert. Gebruik automatische koeling niet met de Ortur-graveur totdat er nieuwe firmware is uitgebracht.
pt_br: Usuário Ortur: Ortur Firmware (todas as versões até 137) existe um bug no resumo da gravação que impede o uso adequado da função de resfriamento automático. Por favor, não use o resfriamento automático com o gravador Ortur até que um novo firmware seja lançado.
zh_tw: Ortur用戶：Ortur固件（所有版本最高為137）在加工履歷上存在一個錯誤，導致無法正確使用自動冷卻功能。 在發布新固件之前，請勿在Ortur雕刻機上使用自動冷卻。

# TpAutoCooling.Text
source: Automatic cooling
cs_cz: Automatické chlazení
hu_hu: Automata hűtés
nl_nl: Automatische koeling
pl_pl: Automatyczne chłodzenie
pt_br: Resfriamento Automático
zh_tw: 自動冷卻

# LblHeader.Text
source: LaserGRBL will append this GCode before starting any job. You can customize this code, for example adding M8 to turn on fan. Here you can use the same syntax of custom buttons if you need to push some positioning related to the specific job is going to be executed.
cs_cz: LaserGRBL provede tento G-kód na začátku jakékoli úlohy. Tento kód můžete upravit, například přidání M8 zapne ventilátor nebo pokud potřebujete provést specifické polohování související s konkrétní úlohou. Syntaxe kódu je stejná jako u vlastních tlačítek.
hu_hu: LaserGRBL beszúrja az alábbi GCode-ot minden mukna megkezdése elé Szerkesztheti ezt a kódot, például beírhatja az M8 parancsot a ventillátor bekapcsolásához Itt ugyanazt a szintaxist használhatja, mint az egyéni gomboknál, ha valamiféle pozíció-beállítást szeretne beszúrni a munka megkezdése előtt
nl_nl: LaserGRBL zal deze GCode toevoegen voordat een taak wordt gestart. U kunt deze code aanpassen, bijvoorbeeld door M8 toe te voegen om de ventilator in te schakelen. Hier kunt u dezelfde syntaxis van aangepaste knoppen gebruiken als u op een bepaalde positie moet drukken met betrekking tot de specifieke taak zal worden uitgevoerd.
pl_pl: LaserGRBL uruchamia ten GCode na początku każdego zadania. Możesz zmodyfikować ten kod, na przykład dodając włączniki M8, aby włączyć wentylator. Tutaj możesz użyć tej samej składni przycisków niestandardowych, jeśli potrzebujesz przesunąć pewne pozycjonowanie związane z konkretnym zadaniem, które ma zostać wykonane.
pt_br: O LaserGRBL anexará este GCode antes de iniciar qualquer trabalho. Você pode personalizar esse código, por exemplo, adicionando M8 para ligar o ventilador. Aqui você pode usar a mesma sintaxe dos botões personalizados se precisar forçar algum posicionamento relacionado ao trabalho específico que será executado.
zh_tw: LaserGRBL在每個任務開始時運行此GCode(開始前工作G代碼)。 您可以修改此代碼，例如，通過添加M8開關來打開風扇。 如果需要移動，可以在此處使用相同的自定義按鈕語法 與要執行的特定任務相關聯的特定定位。 預設 G90 （使用絕對坐標）

# groupBox2.Text
source: Footer
cs_cz: Zápatí
hu_hu: Lábléc
nl_nl: Voet
pl_pl: Stopka
pt_br: Rodapé
zh_tw: 結束後工作G代碼

# groupBox3.Text
source: Multiple Passes
cs_cz: Opakované průchody (vykonání kódu)
hu_hu: Többszöri végrehajtás
nl_nl: Meerdere herhalingen
pl_pl: Wielokrotne przejścia
pt_br: Passos Múltiplos
zh_tw: 重復次數之間的G代碼

# LblFooter.Text
source: LaserGRBL will enqueue this GCode at the end of any job. Can be used to push back your engraver in a initial state like going back to zero position or sending M9 to turn off fan etc. Here you can use the same syntax of custom buttons.
cs_cz: LaserGRBL provede tento G-kód na konci jakékoli úlohy. Například lze použít k nastavení stroje do výchozího stavu, návrat do nulové polohy nebo odeslání M9 pro vypnutí ventilátoru, apod. Syntaxe kódu je stejná jako u vlastních tlačítek.
hu_hu: LaserGRBL hozzáfűzi ezt a kódrészt bármely munka végéhez. Használható pélául, hogy a gravírozót visszaküldje egy kezdő pozícióba, például a null-pontba, vagy elküldheti az M9 parancsot a ventillátor kikapcsolásához Itt ugyanazt a szintaxist használhatja, mint az egyéni gomboknál
nl_nl: LaserGRBL zal deze GCode aan het einde van elke taak in de wachtrij plaatsen. Kan worden gebruikt om uw graveur terug te duwen in een begintoestand, zoals teruggaan naar de nulpositie of M9 sturen om de ventilator uit te schakelen, enz. Hier kunt u dezelfde syntaxis van aangepaste knoppen gebruiken.
pl_pl: LaserGRBL zapisuje ten GCode pod koniec każdego zadania. Można go użyć do cofnięcia grawera w początkowym stanie, jak powrót do pozycji zerowej lub wysyłanie M9 w celu wyłączenia wentylatora itp. Tutaj możesz użyć tej samej składni przycisków niestandardowych.
pt_br: O LaserGRBL enfileirará este GCode no final de qualquer trabalho. Pode ser usado para forçar seu gravador para um estado inicial, como voltar à posição zero ou enviar M9 para desligar o ventilador, etc. Aqui você pode usar a mesma sintaxe dos botões personalizados.
zh_tw: LaserGRBL在每個任務結束時運行此GCode(結束後工作G代碼)。 它可以用於在初始狀態下縮回雕刻，例如返回到XYZ-零點位置 或發送M9來關閉風扇等。 在這裡，您可以使用相同的自定義按鈕語法。 預設 G0 X0 Y0 Z0 （移回原點）

# LblPasses.Text
source: When performing multiple passes LaserGRBL will push this GCode in the between of each passes. Can be used to move Z down to perform deeper cuts. Here you can use the same syntax of custom buttons.
cs_cz: Při provádění více průchodů LaserGRBL provede tento G-kód mezi každým průchodem. Například lze použít k posunutí osy Z dolů při provádění řezů hlouběji. Syntaxe kódu je stejná jako u vlastních tlačítek.
hu_hu: Amikor egy munkát többször hajt végre, a LaserGRBL beszúrja az alábbi kódot minden végrehajtás közé Használható a Z tengely lefelé mozgatására, mélyebb vágás érdekében Itt ugyanazt a szintaxist használhatja, mint az egyéni gomboknál
nl_nl: Bij het uitvoeren van meerdere passen zal LaserGRBL deze GCode tussen elke herhaling duwen. Kan worden gebruikt om Z naar beneden te verplaatsen om diepere sneden uit te voeren. Hier kunt u dezelfde syntaxis van aangepaste knoppen gebruiken.
pl_pl: Podczas wykonywania wielu przejść LaserGRBL uruchamia ten GCode między kolejnymi przejściami. Może służyć do przesuwania osi Z w dół, aby wykonywać głębsze cięcia. Tutaj możesz użyć tej samej składni przycisków niestandardowych.
pt_br: Ao executar várias passagens, o LaserGRBL enviará este GCode entre cada passagem. Pode ser usado para mover Z para baixo para realizar cortes mais profundos. Aqui você pode usar a mesma sintaxe dos botões personalizados.
zh_tw: 執行重復次數時，LaserGRBL在兩次通過之間運行此GCode。 可用於向下移動Z軸以進行更深的切割。 當切割較厚的材質時，在切割面下沉時，激光對焦也隨之變動，利用這個能讓切割效率不減。使用這個前提是需要配置Z軸套件。 在這裡，您可以使用相同的自定義按鈕語法。 預設 G91 G0 Z-1（下沉Z軸） G90

# label23.Text
source: Here you can set another sound for success events, like when a job is finished. Check to enable.
cs_cz: Zde můžete nastavit jiný zvuk pro úspěšné události, například po dokončení úlohy. Zaškrtnutím povolíte.
hu_hu: Itt tudja beállítani a sikeres műveletek hangját, mint például amikor egy munka befejeződik. Jelölje be az aktiváláshoz.
nl_nl: Hier kunt u een ander geluid instellen voor succesvolle gebeurtenissen, zoals wanneer een taak is voltooid. Vink aan om in te schakelen.
pl_pl: Tutaj możesz ustawić inny dźwięk zdarzeń związanych z sukcesem, takich jak zakończenie pracy. Zaznacz, aby włączyć.
pt_br: Aqui você pode definir outro som para eventos de sucesso, como quando um trabalho é concluído. Marque para habilitar.
zh_tw: 在這裡，您可以為與成功相關的事件設置不同的聲音，例如"終止工作聲音"。 勾選欄位為啟用

# label24.Text
source: Here you can set another warning sound. This usually fired on a bad GCode command, but your machine can continue operating. Check to enable.
cs_cz: Zde můžete nastavit jiný výstražný zvuk, typicky při špatném příkazu G-kódu, ale může se pokračovat v provozu. Zaškrtnutím povolíte.
hu_hu: Itt tudja beállítani a figyelmeztető hangjelzést. Ez általában hibás GCode parancsot jelent, és a gép folytatni tudja a működést. Jelölje be az aktiváláshoz.
nl_nl: Hier kunt u nog een waarschuwingsgeluid instellen. Dit wordt meestal getoond bij een slecht GCode-commando, maar uw machine kan blijven werken. Vink aan om in te schakelen.
pl_pl: Tutaj możesz ustawić kolejny dźwięk ostrzegawczy. Zwykle był uruchamiany przy złym poleceniu GCode, ale komputer może nadal działać. Zaznacz, aby włączyć.
pt_br: Aqui você pode definir outro som de aviso. Isso geralmente é acionado em um comando GCode ruim, mas sua máquina pode continuar operando. Marque para habilitar.
zh_tw: 在這裡您可以設置另一個"警告聲"。 通常是使用錯誤的GCode命令運行的，但是計算機可能仍在工作。 勾選欄位為啟用

# label26.Text
source: Warning Sound
cs_cz: Upozornění
hu_hu: Figyelmeztető hangjelzés
nl_nl: Waarschuwings geluid
pl_pl: Dźwięk ostrzegawczy
pt_br: Som de Aviso
zh_tw: 警告聲

# changeWarBtn.Text
source: Change
cs_cz: Vybrat soubor
hu_hu: Lecserél
nl_nl: Edit
pl_pl: Zmiana
pt_br: Mudar
zh_tw: 更改

# label27.Text
source: Sound File
cs_cz: Soubor zvuku
hu_hu: Hangfájl
nl_nl: Geluids bestand
pl_pl: Plik dźwiękowy
pt_br: Arquivo de Som
zh_tw: 聲音文件

# label29.Text
source: Error Sound
cs_cz: Chyba
hu_hu: Hiba hangjelzés
nl_nl: Fout geluid
pl_pl: Dźwięk błędu
pt_br: Som de Erro
zh_tw: 錯誤聲音

# changeFatBtn.Text
source: Change
cs_cz: Vybrat soubor
hu_hu: Lecserél
nl_nl: Wijzig
pl_pl: Zmiana
pt_br: Mudar
zh_tw: 更改

# label30.Text
source: Sound File
cs_cz: Soubor zvuku
hu_hu: Hangfájl
nl_nl: Geluidsbestand
pl_pl: Plik dźwiękowy
pt_br: Arquivo de Som
zh_tw: 聲音文件

# label34.Text
source: Connect Sound
cs_cz: Připojení
hu_hu: Kapcsolódási hangjelzés
nl_nl: Verbindings geluid
pl_pl: Dźwięk połączenia
pt_br: Som de Conexão
zh_tw: 成功連接聲音

# changeConBtn.Text
source: Change
cs_cz: Vybrat soubor
hu_hu: Lecserél
nl_nl: Wijzig
pl_pl: Zmiana
pt_br: Mudar
zh_tw: 更改

# label35.Text
source: Sound File
cs_cz: Soubor zvuku
hu_hu: Hangfájl
nl_nl: Geluidsbestand
pl_pl: Plik dźwiękowy
pt_br: Arquivo de Som
zh_tw: 聲音文件

# label37.Text
source: Disconnect Sound
cs_cz: Odpojení
hu_hu: Szétkapcsolás hangjelzés
nl_nl: Loskoppelen Geluid
pl_pl: Dźwięk rozłączenia
pt_br: Som Desconectar
zh_tw: 中斷連接聲音

# changeDconBtn.Text
source: Change
cs_cz: Vybrat soubor
hu_hu: Lecserél
nl_nl: Wijzig
pl_pl: Zmiana
pt_br: Mudar
zh_tw: 更改

# label38.Text
source: Sound File
cs_cz: Soubor zvuku
hu_hu: Hangfájl
nl_nl: Geluids bestand
pl_pl: Plik dźwiękowy
pt_br: Arquivo de Som
zh_tw: 聲音文件

# LblSuccessSound.Text
source: Success Sound
cs_cz: Úspěšné operace
hu_hu: Siker hangjelzés
nl_nl: Succes Geluid
pl_pl: Dźwięk sukcesu
pt_br: Som de Sucesso
zh_tw: 終止工作聲音

# changeSucBtn.Text
source: Change
cs_cz: Vybrat soubor
hu_hu: Lecserél
nl_nl: Wijzig
pl_pl: Zmiana
pt_br: Mudar
zh_tw: 更改
