Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/SettingsForm.*.resx
Languages: cs_cz, hu_hu, nl_nl, pl_pl, pt_br, zh_tw

# label25.Text
source: Sound File
cs_cz: Soubor zvuku
hu_hu: Hangfájl
nl_nl: Geluidsbestand
pl_pl: Plik dźwiękowy
pt_br: Arquivo de Som
zh_tw: 聲音文件

# label32.Text
source: Here you can set a sound for a successful connection. Check to enable.
cs_cz: Zde můžete nastavit zvuk pro úspěšné připojení. Zaškrtnutím povolíte.
hu_hu: Itt állíthatja be a sikeres kapcsolódás hangjelzését. Jelölje be az aktiváláshoz.
nl_nl: Hier kunt u een geluid instellen voor een succesvolle verbinding. Vink aan om in te schakelen.
pl_pl: Tutaj możesz ustawić dźwięk udanego połączenia. Zaznacz, aby włączyć.
pt_br: Aqui você pode definir um som para uma conexão bem-sucedida. Marque para habilitar.
zh_tw: 在這裡您可以設置"成功連接聲音"。 勾選欄位為啟用。

# label36.Text
source: Here you can set a sound for disconnection. Useful for some WiFi connections. Check to enable.
cs_cz: Zde můžete nastavit zvuk pro odpojení. Užitečné pro některá připojení WiFi. Zaškrtnutím povolíte.
hu_hu: Itt állíthatja be a szétkapcsolás hangjelzését. Néhány WiFi kapcsolat esetén hasznos lehet. Jelölje be az aktiváláshoz.
nl_nl: Hier kun je een geluid instellen voor loskoppelen. Handig voor WiFi verbindingen.
pl_pl: Tutaj możesz ustawić dźwięk rozłączenia. Przydatny w przypadku niektórych połączeń WiFi. Zaznacz, aby włączyć.
pt_br: Aqui você pode definir um som para desconexão. Útil para algumas conexões WiFi. Marque para habilitar.
zh_tw: 在這裡您可以設置"中斷連接聲音"。 對於某些WiFi連接很有用。 勾選欄位為啟用

# label28.Text
source: Here you can set an error sound for fatal errors. This means, your job most likely stopped, and LaserGRBL can not continue the operation. Check to enable.
cs_cz: Zde můžete nastavit zvuk pro závažné chyby. To znamená, že se Vaše úloha s největší pravděpodobností zastavila a LaserGRBL nemůže pokračovat. Zaškrtnutím povolíte.
hu_hu: Itt állíthaja be a végzetes hiba hangjelzését. Ez olyan hibát jelent, ahol a munka megszakad, és a LaserGRBL nem tudja folytatni. Jelölje be az aktiváláshoz.
nl_nl: Hier kun je een geluid instellen voor fatale fouten. Dit betekend, dat je job waarschijnlijk is gestopt, LaserGRBL kan niet vervolgen. Check om in te schakelen.
pl_pl: Tutaj możesz ustawić dźwięk błędu dla błędów krytycznych. Oznacza to, że Twoje zadanie najprawdopodobniej zostało zatrzymane, a LaserGRBL nie może kontynuować operacji. Zaznacz, aby włączyć.
pt_br: Aqui você pode definir um som de erro para erros fatais. Isso significa que seu trabalho provavelmente parou e o LaserGRBL não pode continuar a operação. Marque para habilitar.
zh_tw: 在這裡，您可以為嚴重錯誤設置"錯誤聲音"。 這意味著您的任務可能已停止， 並且LaserGRBL無法繼續操作。 勾選欄位為啟用

# label44.Text
source: Don't notify if job time less then
pt_br: Não notifique se o tempo de trabalho for menor que

# label31.Text
source: Telegram notification
nl_nl: Telegram notificatie
pt_br: Notificação do Telegram

# label33.Text
source: Personal Code
nl_nl: Persoonlijke code
pt_br: Código Pessoal

# BtnTestNotification.Text
source: Test
pt_br: Teste

# label42.Text
source: If you have telegram search for @LaserGRBL bot Obtain your personal code and write it here!
nl_nl: Als u Telegram hebt, zoek dan naar @LaserGRBL bot. Verkrijg je persoonlijke code en type het hier!
pt_br: Se você tiver o Telegram, procure o bot @LaserGRBL Obtenha seu código pessoal e escreva-o aqui!

# TpSoundSettings.Text
source: Notification
cs_cz: Zvuky
hu_hu: Hangbeállítások
nl_nl: Notificatie
pl_pl: Ustawienia dźwięku
pt_br: Notificação
zh_tw: 聲音設定

# SoundBrowserDialog.Filter
source: Waveform Audio File|*.wav
cs_cz: Zvukové soubory|*.wav
hu_hu: Waveform Audio Fájl|*.wav
nl_nl: Waveform Audio bestand|*.wav
pl_pl: Plik audio Waveform | * .wav
pt_br: Arquivo de Áudio em Forma de Onda|*.wav

# label15.Text
source: min
hu_hu: perc
zh_tw: 分鐘

# label17.Text
source: min
hu_hu: perc
zh_tw: 分鐘

# TpGCodeSettings.Text
source: GCode
cs_cz: G-kód

# warningSoundLabel.Text
source: .\Sound\warning.wav
pl_pl: .\Sound\non-fatal.wav
