Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/Strings.*.resx
Languages: cs_cz, de, es, hu_hu, it, pt_br, sk_sk, zh_tw

# DisconnectAnyway
source: File transfer in progress. Disconnect anyway?
cs_cz: Probíhá přenos souboru. Přesto odpojit?
de: Dateiübertragung läuft. Verbindung trotzdem trennen?
es: Transferencia de archivo en progreso. ¿Desconectar de todas maneras?
hu_hu: A fájlátvitel folyamatban van. Megszakítja a kapcsolatot?
it: E' in corso un lavoro. Disconnettere ugualmente?
pt_br: Transferência de arquivo em andamento. Desconectar mesmo assim?
sk_sk: Prebieha prenos súboru. Napriek tomu odpojiť?
zh_tw: 正在進行文件傳輸。 還是要斷開連接？

# BoxDeleteCustomButtonText
source: Are you sure to delete selected button?
cs_cz: Opravdu chcete vymazat vybrané tlačítko?
de: Sind Sie sicher, dass Sie die ausgewählte Schaltfläche löschen wollen?
es: ¿Estás seguro de eliminar el botón seleccionado?
hu_hu: Biztosan törli a kiválasztott gombot?
it: Sei sicuro di cancellare il pulsante?
pt_br: Tem certeza de que deseja excluir o botão selecionado?
sk_sk: Naozaj chcete vymazať chýbajúce tlačidlo?
zh_tw: 您確定要刪除所選按鈕嗎？

# BoxAbortProgramConfirm
source: Abort current job?
cs_cz: Zrušit aktuální úlohu?
de: Aktuelle Tätigkeit abbrechen?
es: ¿Abortar trabajo actual?
hu_hu: Megszakítja az aktuális munkát?
it: Terminare il lavoro corrente?
pt_br: Abortar trabalho atual
sk_sk: Zrušiť aktuálnu polohu?
zh_tw: 中止當前工作？

# DirectionNewCross
source: Cross Fill
cs_cz: Křížová výplň
de: Kreuz-Füllung
es: Relleno cruzado
it: Crocette
pt_br: P. Cruzado

# DirectionNewDiagonalCross
source: Diagonal Cross Fill
cs_cz: Diagonální křížová výplň
de: Diagonal Kreuz-Füllung
es: Relleno cruzado diagonal
it: Crocette diagonali
pt_br: P. Cruzado Diagonal

# DirectionNewDiagonalGrid
source: Diagonal Grid
cs_cz: Diagonální mřížka
de: Diagonal Gitter
es: Cuadrícula diagonal
it: Griglia diagonale
pt_br: Grade Diagonal

# DirectionNewGrid
source: Grid
cs_cz: Mřížka
de: Gitter
es: Cuadrícula
it: Griglia
pt_br: Grade

# DirectionNewInsetFilling
source: Inset Filling
cs_cz: Vložená výplň
de: Einsatz-Füllung (nach innen gerichtet)
it: Concentrico
pt_br: P. Embutido

# DirectionNewReverseDiagonal
source: Diagonal Reversed
cs_cz: Diagonálně obráceně
de: Diagonal Umgekehrt
es: Diagonal invertido
it: Diagonale invertito
pt_br: Diagonal Invertida

# DirectionNewSquares
source: Squares
cs_cz: Čtverce
de: Quadrate
it: Quadretti
pt_br: Quadrados

# WarnWrongLaserMode
source: "M4 Dynamic Laser Power Mode" has been set, but your engraver doesn't seem to support it. Only engravers with grbl version >= 1.1 with "laser mode" enabled ($32=1) can take advantage of M4 option.
cs_cz: „M4 dynamický výkon laseru“ byl nastaven, ale Vaše zařízení to zřejmě nepodporuje. Pouze zařízení s verzí grbl > = 1,1 s „laserovým režimem“ ($ 32 = 1) může využít možnosti M4.
pt_br: O "M4 Modo de Força de Laser Dinâmico" foi definido, mas seu gravador não parece suportá-lo. Somente gravadores com versão grbl >= 1.1 com "modo laser" ativado ($32=1) podem aproveitar a opção M4.

# WarnWrongLaserModeTitle
source: Warning
cs_cz: Upozornění
de: Warnung
pt_br: Aviso

source: Dithering Options
pt_br: Opções de pontilhamento

# Line2LineOptions
source: Line To Line Options
pt_br: Opções de Linha a Linha

# WarnUnlockProportionText
source: Freely assigning the width and height of the work can lead to distortion of the image. Do you want to continue?
pt_br: Atribuir livremente a largura e a altura do trabalho pode levar à distorção da imagem. Você quer continuar?

# WarnUnlockProportionTitle
source: Warning
pt_br: Aviso

# BoxTelegramSettingText
source: Test notification has been sent, please check your phone!
pt_br: Notificação de teste foi enviada, por favor verifique seu celular!

# BoxTelegramSettingTitle
source: Telegram notification
pt_br: Notificação do Telegram

# WarnBufferStuckUnlockText
source: If the buffer is blocked, it is because there was some communication problem with your engraver. If you press "OK" LaserGRBL will ignore the full buffer and send the next commands. If this happens often, you should try to understand the causes of this problem. Click "?" for more information.
pt_br: Se o buffer estiver bloqueado, é porque houve algum problema de comunicação com sua gravadora. Se você pressionar "OK", o LaserGRBL ignorará o buffer cheio e enviará os próximos comandos. Se isso acontecer com frequência, você deve tentar entender as causas desse problema. Clique em "?" Para maiores informações.

# WarnBufferStuckUnlockTitle
source: Unlock buffer
pt_br: Desbloquear buffer

# ProblemConnectingText
source: Error connecting your engraver. If you need help click on "?" button.
pt_br: Erro ao conectar sua gravadora. Se precisar de ajuda, clique em "?" botão.

# ProblemConnectingTitle
source: Problem with connection?
pt_br: Problema com a conexão?

# BoxMachineSizeOutOfRangeTitle
source: Warning
pt_br: Aviso

# BoxMachineSizeOutOfRangeText
source: The engraver has some configuration parameters out of range. Please check machine configuration (menu "Grbl", "Grbl Configuration") parameters 130 and 131.
pt_br: O gravador tem alguns parâmetros de configuração fora do intervalo. Verifique a configuração da máquina (menu "Grbl", "Configuração Grbl ") parâmetros 130 e 131.

# BoxWriteConfigWithoutError
source: {0} Config written successfully!
cs_cz: {0} Konfigurace úspěšně uložena!
de: {0} Config erfolgreich geschrieben!
es: {0} Configuración escrita correctamente!
hu_hu: {0} konfiguráció sikeresen kiírva!
it: {0} valori scritti con successo!
pt_br: {0} Configuração gravada com sucesso!
sk_sk: {0} Konfigurácia úspešne uložená!
zh_tw: {0} 配置成功保存！

# DirectionNewDiagonal
source: Diagonal
cs_cz: Diagonálně
it: Diagonale

# DirectionNewHorizontal
source: Horizontal
cs_cz: Horizontálně
it: Orizzontale

# DirectionNewVertical
source: Vertical
cs_cz: Vertikálně
de: Vertikal
it: Verticale

# DirectionNewZigZag
source: Zig Zag
cs_cz: Cik Cak
de: Zickzack
