Repository: arkypita/LaserGRBL
Catalog: LaserGRBL/Strings.*.resx
Languages: cs_cz, de, es, hu_hu, it, pt_br, sk_sk, zh_tw

# BoxAutoUpdateFailed
source: Automatic update failed! Please manually download the new version from lasergrbl site.
cs_cz: Automatická aktualizace se nazdařila! Stáhněte manuálně novou verzi programu z lasergrbml webu.
de: Automatisches Update fehlgeschlagen! Bitte laden Sie die neue Version manuell von lasergrbl herunter.
es: ¡Actualización automática fallida! Por favor, descargue manualmente la nueva versión desde el sitio de laserGRBL.
hu_hu: Az automatikus frissítés sikertelen! Kérjük, manuálisan töltse le az új verziót a lasergrbl webhelyről.
it: Aggiornamento fallito! Si prega di scaricare manualmente la nuova versione dal sito lasergrbl.com
pt_br: Falha na atualização automática! Baixe manualmente a nova versão do site lasergrbl.
sk_sk: Automatická aktualizácia sa nepodarila! Stiahnite si aktuálnu verziu LaserGRBL z webu.
zh_tw: 自動更新失敗！ 請從lasergrbl手動下載新版本。

# BoxAutoUpdateRequireAdmin
source: Update require administrator privilege!
cs_cz: Aktualizace vyžaduje práva administrátora!
de: Update erfordert Administratorrechte!
es: La actualización requiere privilegios de administrador!
hu_hu: A frissítéshez rendszergazdai jogosultság szükséges!
it: L'aggiornamento richiede i privilegi di amministratore!
pt_br: A atualização requer privilégio de administrador!
sk_sk: Aktualizácia požaduje administrátorské práva!
zh_tw: 更新需要管理員權限!

# BoxAutoUpdateResult
source: Update result
cs_cz: Výsledek aktualizace
de: Update Ergebnis
es: Resultado de la actualización
hu_hu: Frissítés eredménye
it: Risultato aggiornamento
pt_br: Resultado da atualização
sk_sk: Výsledok aktualizácie
zh_tw: 更新結果

# BoxAutoUpdateSuccess
source: Update success!
cs_cz: Úspěšná aktualizace!
de: Update erfolgreich!
es: Actualización correcta!
hu_hu: Frissítés sikeres!
it: Aggiornamento completato!
pt_br: Atualizado com sucesso!
sk_sk: Aktualizácia úspešná!
zh_tw: 更新成功!

# BoxConnectErrorTitle
source: Cannot connect to device
cs_cz: Nelze se spojit se zařízením
de: Kann nicht mit dem Gerät verbinden
es: No se puede conectar al dispositivo
hu_hu: Nem lehet csatlakozni az eszközhöz
it: Impossibile connettersi al dispositivo
pt_br: Não é possível conectar ao dispositivo
sk_sk: Nedá sa spojiť so zariadením
zh_tw: 無法連接到設備

# BoxExportConfigError
source: Error exporting config!
cs_cz: Chyba exportu nastavení!
de: Fehler beim Exportieren der Konfiguration!
es: Error exportando la configuración!
hu_hu: Hiba a konfiguráció exportálásakor!
it: Errore nell'esportare la configurazione!
pt_br: Erro exportando configuração!
sk_sk: Chyba exportu nastavení!
zh_tw: 導出配置時出錯!

# BoxExportConfigErrorTitle
source: Error
cs_cz: Chyba
de: Fehler
hu_hu: Hiba
it: Errore
pt_br: Erro
sk_sk: Chyba
zh_tw: 錯誤

# BoxExportConfigFileNotFound
source: File does not exist!
cs_cz: Soubor neexistuje!
de: Datei existiert nicht!
es: Archivo no existe!
hu_hu: A fájl nem létezik!
it: Il file non esiste!
pt_br: Arquivo não existe!
sk_sk: Súbor neexistuje!
zh_tw: 文件不存在!

# BoxExportConfigSuccess
source: {0} Config exported successfully!
cs_cz: {0} Konfigurace úspěšně exportována!
de: {0} Konfiguration erfolgreich exportiert!
es: {0} Configuración exportada correctamente!
hu_hu: {0} konfiguráció sikeresen exportálva!
it: {0} chiavi esportate con successo!
pt_br: {0} Configuração exportada com sucesso!
sk_sk: {0} Konfigurácia úspešne exportovaná!
zh_tw: {0} 成功導出配置!

# BoxExportConfigSuccessTitle
source: Success
cs_cz: Úspěch
de: Erfolgreich
es: Correcto
hu_hu: Siker
it: Successo
pt_br: Successo
sk_sk: Úspech
zh_tw: 成功

# BoxImportConfigFileError
source: Error reading file!
cs_cz: Chyba načítání souboru
de: Fehler beim lesen der Datei!
es: Error leyendo archivo!
hu_hu: Hiba a fájl olvasása közben!
it: Errore di lettura file!
pt_br: Erro lendo arquivo!
sk_sk: Chyba načítania súboru
zh_tw: 讀取文件時出錯!

# BoxImportConfigWithError
source: {0} Config imported with {1} errors!
cs_cz: {0} Konfigurace naimportována s {1} chybami!
de: {0} Konfiguration importiert mit {1} Fehlern!
es: {0} Configuración importada con {1} errores!
hu_hu: {0} konfiguráció importálása {1} hibával történt!
it: {0} chiavi importate con {1} errori!
pt_br: {0} Configuração importada com {1} erros!
sk_sk: {0} Konfigurácia naimportovaná s {1} chybami!
zh_tw: {0} 配置導入，出現 {1} 錯誤！

# BoxImportConfigWithoutError
source: {0} Config imported successfully!
cs_cz: {0} Konfigurace úspěšně naimportována!
de: {0} Konfiguration erfolgreich importiert!
es: {0} Configuración importada correctamente!
hu_hu: {0} konfiguráció sikeresen importálva!
it: {0} chiavi importate con successo!
pt_br: {0} Configuração importada com sucesso!
sk_sk: {0} Konfigurácia úspešne importovaná!
zh_tw: {0} 配置導入成功!

# CustomButtonEdit
source: Edit button
cs_cz: Upravit tlačítko
de: Schaltfläche Bearbeiten
es: Editar botón
hu_hu: Egyéni gomb szerkesztése
it: Modifica pulsante
pt_br: Editar Botão
sk_sk: Upraviť tlačidlo
zh_tw: 編輯按鈕

# CustomButtonRemove
source: Remove button
cs_cz: Odstranit tlačitko
de: Schaltfläche Entfernen
es: Remover botón
hu_hu: Egyéni gomb eltávolítása
it: Rimuovi pulsante
pt_br: Remover botão
sk_sk: Odstrániť tlačidlo
zh_tw: 刪除按鈕

# DirectionDiagonal
source: Diagonal (old)
cs_cz: Diagonálně (staré)
es: Diagonal (antiguo)
hu_hu: Átlós
it: Diagonale (compatibile)
pt_br: Diagonal (antigo)
sk_sk: Diagonálne (old)
zh_tw: 對角線 (old)

# DirectionHorizontal
source: Horizontal (old)
cs_cz: Horizontálně (staré)
es: Horizontal (antiguo)
hu_hu: Vízszintes
it: Orizzontale (compatibile)
pt_br: Horizontal (antigo)
sk_sk: Horizontálne (old)
zh_tw: 水平線 (old)

# DirectionNone
source: No Filling
cs_cz: Žádná
de: None
es: Ninguno
hu_hu: Egyik sem
it: Nessun riempimento
pt_br: Sem Preenchimento
sk_sk: Žiadna
zh_tw: 沒有

# DirectionVertical
source: Vertical (old)
cs_cz: Vertikálně (staré)
de: Vertikal (old)
es: Vertical (antiguo)
hu_hu: Függőleges
it: Verticale (compatibile)
pt_br: Vertical (antigo)
sk_sk: Vertikálne (old)
zh_tw: 垂直線 (old)

# FormulaCustom
source: Custom
cs_cz: Vlastní
de: Benutzerdefiniert
es: Personalizado
hu_hu: Egyedi
it: Personalizzato
pt_br: Personalizado
sk_sk: Vlastný
zh_tw: 自定義

# FormulaOpticalCorrect
source: OpticalCorrect
cs_cz: Optická korekce
de: Optisch Korrekt
es: Corrección óptica
it: Percettivo
pt_br: CorreçãoÓtica
sk_sk: Optická korekcia
zh_tw: 光學矯正

# FormulaSimpleAverage
source: SimpleAverage
cs_cz: Jednoduchý průměr
de: Einfacher Durchschnitt
es: Promedio simple
it: Media aritmetica
pt_br: MédiaSimples
sk_sk: Jednoduchý priemer
zh_tw: 簡單平均計算

# FormulaWeightAverage
source: WeightAverage
cs_cz: Váhový průměr
de: Gewicht Durchschnitt
es: Promedio de peso
it: Media pesata
pt_br: PesoMédio
sk_sk: Váhový priemer
zh_tw: 加權平均計算

# InterpolationModeHighQualityBicubic
source: Smooth (HQ Bicubic)
cs_cz: Hladký (HQ Bicubic)
de: Sanft (HQ Bicubic)
es: Suavizado (HQ Bicubic)
it: Sfumato (HQBicubic)
pt_br: Suave (HQ Bicubic)
sk_sk: Hladký (HQ Bicubic)
zh_tw: 平滑 (HQ Bicubic)

# InterpolationModeNearestNeighbor
source: Sharp (NearestNeighbor)
cs_cz: Ostrý (NearestNeighbor)
de: Scharf (nächster Nachbar)
it: Bordi netti (NearestNeighbor)
pt_br: Sharp (Vizinho mais próximo)
sk_sk: Ostrý (NearestNeighbor)
zh_tw: 尖銳 (Nearest Neighbor)

# LanguageRequireRestart
source: Restart required
cs_cz: Vyžadován restart
de: Neustart erforderlich
es: Reinicio requerido
hu_hu: Újraindítás szükséges
it: Riavvio richiesto
pt_br: Reinicialização requerida
sk_sk: Vyžadovaný reštart
zh_tw: 需要重新啟動

# LanguageRequireRestartNow
source: Require application restart, restart now?
cs_cz: Vyžadovaný restart aplikace, restartovat nyní?
de: Neustart der Anwendung erforderlich, jetzt neu starten?
es: Requiere reiniciar la aplicación, ¿Reiniciar ahora?
hu_hu: Az alkalmazás újraindítást igényel, újraindítja most?
it: E' necessario riavviare l'applicazione. Riavviare ora?
pt_br: Exige reinicialização do aplicativo, reiniciar agora?
sk_sk: Vyžadovaný reštart splikacie, Reštartovať teraz?
zh_tw: 該軟體必須重新啟動。 現在重啟嗎？

# MacStatusAlarm
source: Alarm
es: Alarma
hu_hu: Riasztás
it: Allarme
pt_br: Alarme
zh_tw: 警告

# MacStatusCheck
source: Check
cs_cz: Kontrola
de: Kontrolle
hu_hu: Jelölje be
it: Verifica
pt_br: Verificar
sk_sk: Kontrola
zh_tw: 檢查

# MacStatusConnecting
source: Connecting
cs_cz: Připojování
de: Verbinden
es: Conectando
hu_hu: Csatlakozás
it: In connessione
pt_br: Conectando
sk_sk: Pripojovanie
zh_tw: 連接中

# MacStatusDisconnected
source: Disconnected
cs_cz: Odpojeno
de: Trennen
es: Desconectado
hu_hu: Lecsatlakozva
it: Disconnesso
pt_br: Desconectado
sk_sk: Odpojené
zh_tw: 斷開

# MacStatusDoor
source: Door
cs_cz: Dveře
de: Tür
es: Puerta
hu_hu: Ajtó
it: Porta
pt_br: Porta
sk_sk: Dvere
zh_tw: 通過

# MacStatusHold
source: Hold
cs_cz: Zastaveno
de: Halten
es: Detener
hu_hu: Tartásban
it: In pausa
pt_br: Pausar
sk_sk: Zastavené
zh_tw: 停止了

# MacStatusHome
source: Home
cs_cz: Domů
es: Punto de partida
it: Homing
pt_br: Início
sk_sk: Domov

# MacStatusIdle
source: Idle
cs_cz: Klid
de: Leerlauf
es: Sin trabajos
hu_hu: Tétlen
it: Pronto
pt_br: Espera
sk_sk: Kľud
zh_tw: 空閒

# MacStatusJog
source: Jog
cs_cz: Polohování
de: Tippen
it: Posizionamento
pt_br: Mover
sk_sk: Polohovanie
zh_tw: 定位

# MacStatusRun
source: Run
cs_cz: Běží
es: Iniciar
hu_hu: Fut
it: In esecuzione
pt_br: Executar
sk_sk: Beží
zh_tw: 運行

# MacStatusUnknown
source: Unknown
cs_cz: Neznámý
de: Unbekannt
es: Desconocido
hu_hu: Ismeretlen
it: Sconosciuto
pt_br: Desconhecido
sk_sk: Neznámy
zh_tw: 未知

# MainFormEstimatedTime
source: Estimated Time:
cs_cz: Odhadovaný čas:
de: Geschätzte Zeit:
es: Tiempo Estimado:
hu_hu: Becsült idő:
it: Tempo Stimato:
pt_br: Tempo Estimado:
sk_sk: Odhadovaný čas:
zh_tw: 預計的時間：

# MainFormProjectedTime
source: Projected Time:
cs_cz: Plánovaný čas:
de: Prognostizierte Zeit:
es: Tiempo proyectado:
hu_hu: Tervezett idő:
it: Proiezione:
pt_br: Tempo Estimado:
sk_sk: Plánovaný čas:
zh_tw: 預計時間：

# WarnSoftLimitOOB
source: You have set a size and offset that makes the job larger than the workspace configured in your engraver ({0}mm x {1}mm). Grbl Parameters $130 and $131. This could generate a soft-limit error or the machine could crash into the axes boundary. Are you sure of the entered values?
cs_cz: Nastavili jste velikost a posunutí, díky čemuž je úloha větší než nakonfigurovaný pracovní prostor ({0} mm x {1} mm). Parametry Grbl 130 $ a 131 $. To by mohlo vygenerovat chybu soft-limitu nebo by mohl být problém s hranicemi pro osy. Jste si jisti zadanými hodnotami?
it: Hai impostato dimensioni e offset di lavoro più grandi dello spazio di lavoro impostato per la tua marcatrice ({0}mm x {1}mm). Parametri grbl $130 e $131. Questo può generare errori durante la lavorazione e la collisione con la fine dell'asse di lavoro. Sei sicuro dei valori impostati?
pt_br: Você definiu um tamanho e deslocamento que torna o trabalho maior do que o espaço de trabalho configurado no seu gravador ({0}mm x {1}mm). Parâmetros Grbl $130 e $131. Isso pode gerar um erro de limite suave ou a máquina pode colidir com o limite dos eixos. Tem certeza dos valores inseridos?

# WarnSoftLimitNS
source: You have set negative offsets, but your engraver is set to use positive space with soft limit alarm enabled ($20=1). This could generate a soft-limit error. Are you sure of the entered values?
cs_cz: Nastavili jste záporné hodnoty, ale Vaše zařízení je nastaveno pro používání pracovního prostoru s kladnými hodnotami a se zapnutým alarmem soft-limitu ($20 = 1). To by mohlo vygenerovat chybu soft-limitu. Jste si jisti zadanými hodnotami?
it: Hai impostato un offset negativo, ma la tua marcatrice è impostata per uno spazio di lavoro positivo. Questo potrebbe generare errori durante la lavorazione. Sei sicuro dei valori impostati?
pt_br: Você definiu deslocamentos negativos, mas seu gravador está configurado para usar espaço positivo com alarme de limite suave ativado ($ 20 = 1). Isso pode gerar um erro de limite flexível. Tem certeza dos valores inseridos?

# AddCustomButtonsHint
source: Right click here to add custom buttons
cs_cz: Klikněte na pravé tlačítko myši pro přidání vlastního tlačítka
de: Klicken Sie hier mit der rechten Maustaste, um benutzerdefinierte Schaltflächen hinzuzufügen
es: Click derecho aquí para agregar botones personalizados
it: Click desto per aggiungere pulsanti personalizzati
pt_br: Clique com o botão direito aqui para adicionar botões personalizados
zh_tw: 右鍵單擊此處添加自定義按鈕

# FirmwareRequireRestart
source: Restart required
cs_cz: Vyžadován restart
de: Neustart erforderlich
es: Reinicio requerido
hu_hu: Újraindítás szükséges
it: E' richiesto un riavvio
pt_br: É necessário reiniciar
sk_sk: Vyžadovaný reštart
zh_tw: 需要重啟

# BoxImportCustomButtonrCaption
source: Confirmation
cs_cz: Potvrzení
de: Bestätigung
es: Confirmación
hu_hu: Megerősítés
it: Conferma
pt_br: Confirmação
sk_sk: Potvrdenie
zh_tw: 確認

# BoxReadConfigSuccess
source: {0} Config read successfully!
cs_cz: {0} Konfigurace úspěšně načtena!
de: {0} Konfiguration erfolgreich gelesen!
es: {0} Configuración leída correctamente!
hu_hu: {0} konfiguráció sikeresen beolvasva!
it: Ho letto {0} valori di configurazione
pt_br: {0} Configuração lida com sucesso!
sk_sk: {0} Konfigurácia úspešne načítaná!
zh_tw: {0} 配置正確讀取！

# WarnCenterline64bit
source: Centerline option is not compatible with your PC. 64bit OS is needed!
cs_cz: Středová čára je možnost, která není kompatibilní s Vaším PC, je vyžadován 64 bitový operační systém!
es: La opción centroline no es compatible con su PC. ¡Se necesita un sistema operativo de 64 bits!
it: L'opzione linea centrale non è compatibile con il tuo computer. E' richiesto un sistema a 64bit.
pt_br: A opção de linha central não é compatível com seu PC. É necessário um Sistema Operacional de 64 bits!

# BoxReadConfigError
source: Error reading config!
cs_cz: Chyba čtení konfigurace!
de: Fehler beim Lesen der Konfiguration!
es: Error leyendo configuración!
hu_hu: Hiba a konfiguráció olvasásakor!
it: Errore nella lettura di configurazione
pt_br: Erro lendo configuração!
sk_sk: Chyba čítania konfigurácie!
zh_tw: 讀取配置錯誤！

# BoxImportCustomButtonCaption
source: Import custom button
cs_cz: Import vlastních tlačítek
de: Benutzerdefinierte Schaltfläche importieren
es: Importar botón personalizado
hu_hu: Egyéni gombok importálása
it: Importare i pulsanti
pt_br: Importar botão customizado
sk_sk: Import vlastných tlačidiel
zh_tw: 導入按鈕

# BoxReadConfigPleaseConnect
source: Showing cached values...
cs_cz: Zobrazit hodnoty v paměti cache
de: Zwischengespeicherte Werte anzeigen...
es: Mostrando valores en caché...
hu_hu: Tárolt értékek megjelenítése
it: Mostro valori precedenti
pt_br: Mostrando valores em cache...
sk_sk: Zobraziť hodnoty v pamäti cache
zh_tw: 顯示以前的值

# BoxCustomButtonPleaseToolTipText
source: Please provide tooltip text
cs_cz: Prosím zadejte popisek
de: Bitte geben Sie einen Tooltip-Text an
es: Por favor ingresa la información de la herramienta
hu_hu: Kérjük, adja meg az eszköztipp szövegét
it: E' necessario fornire un titolo
pt_br: Forneça o texto da dica de ferramenta
sk_sk: Prosím zadajte popis
zh_tw: 輸入提示文字

# FirmwareRequireRestartNow
source: Restart is required to apply Firmware type changes. Restart now?
cs_cz: Restart je potřebný pro změnu typu firmwaru kontroléru. Restartovat nyní?
de: Ein Neustart ist erforderlich, um Änderungen des Firmware-Typs anzuwenden. Jetzt neu starten?
es: Reinicio es requerido para aplicar los cambios al Firmware. ¿Reiniciar ahora?
hu_hu: Újraindítás szükséges a firmware-típusú változások végrehajtásához. Újraindítás most?
it: E' richiesto un riavvio. Riavviare ora?
pt_br: A reinicialização é necessária para aplicar as alterações de tipo de firmware. Reinicie agora?
sk_sk: Reštart je potrebný pre zmenu typu firmwaru kontroléra. Reštartovať teraz?
zh_tw: 需要重新啟動電腦。 現在重啟嗎？

# WarnLine2LinePWM
source: Line2Line option is not compatible with your engraver or with your configuration. PWM-able laser is needed, and PWM support should be enabled in LaserGRBL settings.
cs_cz: Možnost Line2Line není kompatibilní s Vaším zařízením nebo s Vaší konfigurací. Je zapotřebí PWM řízení, měla by být také povolené PWM v nastavení LaserGRBL.
es: La opción Line2Line no es compatible con el grabador o con la configuración. Se necesita láser PWM y se debe habilitar el soporte PWM en los valores de LaserGRBL.
it: L'opzione Line2Line non è compatibile con la tua marcatrice o con la tua configurazione. E' necessario un laser capace di modulazione di potenza (PWM) e il supporto PWM deve essere attivato in configurazione.
pt_br: A opção Line2Line não é compatível com sua gravadora ou com sua configuração. Laser compatível com PWM é necessário e o suporte a PWM deve ser ativado nas configurações do LaserGRBL.

# MsgboxCannotOpenFileNow
source: Cannot open a new file now.
cs_cz: Nelze nyní otevřít nový soubor.
de: Jetzt kann gerade keine neue Datei geöffnet werden.
es: No se puede abrir un nuevo archivo ahora.
it: Non posso aprire un file in questo momento.
pt_br: Não é possível abrir um novo arquivo agora.

# BoxWriteConfigNoChange
source: No changes... nothing to write!
cs_cz: Žádné změny... Nic k uložení!
de: Keine Änderungen... nichts zu schreiben!
es: No hay cambios... nada para escribir!
hu_hu: Nincs változás ... nincs mit írni!
it: Non ci sono modifiche da salvare!
pt_br: Sem alterações... nada a escrever!
sk_sk: Žiadne zmeny... nič na uloženie!
zh_tw: 沒有要保存的更改！

# BoxCustomButtonPleaseGCodeText
source: Please provide GCode commands
cs_cz: Prosím zadejte příkaz G-kódu
de: Bitte GCode-Befehle angeben
es: Por favor, proporcione comandos GCode
hu_hu: Kérjük, adja meg a GCode parancsokat
it: E' necessario fornire un comando
pt_br: Forneça os comandos do GCode
sk_sk: Prosím zadajte príkaz G-kódu
zh_tw: 需要一個命令

# ResumeJobHomingRequiredTitle
source: Unknown position
cs_cz: Neznámá pozice
de: Unbekannte Position
es: Posición desconocida
hu_hu: Ismeretlen helyzet
it: Posizione sconosciuta
pt_br: Posição desconhecida
sk_sk: Neznámá pozícia
zh_tw: 位置未知

# SpeedSliderToolTip
source: Speed:
cs_cz: Rychlost:
de: Geschwindigkeit:
es: Velocidad:
it: Velocità:
pt_br: Velocidade:
zh_tw: 移動速度(mm / min)：

# BoxCustomButtonPleaseToolTipTitle
source: Missing field
cs_cz: Chybějící položka
de: Fehlendes Feld
es: Campo vacío
hu_hu: Hiányzó mező
it: Campo mancante
pt_br: Campo faltante
sk_sk: Chýbajúca položka
zh_tw: 遺失領域

# BoxDeleteCustomButtonTitle
source: Delete custom button
cs_cz: Odstranění vlastního tlačítka
de: Benutzerdefinierte Schaltfläche löschen
es: Eliminar botón personalizado
hu_hu: Az egyéni gomb törlése
it: Elimina il pulsante
pt_br: Apagar botão personalizado
sk_sk: Odstránenie vlastného tlačidla
zh_tw: 刪除自定義按鈕

# WarnSoftLimitTitle
source: Job boundary confirmation
cs_cz: Potvrzení hranice úlohy
it: Conferma superamento limiti
pt_br: Confirmação de limite de trabalho

# ExitAnyway
source: File transfer in progress. Exit anyway?
cs_cz: Probíhá přenos souboru. Přesto ukončit?
de: Dateiübertragung läuft. Trotzdem beenden?
es: Transferencia de archivos en progreso. ¿Salir de todos modos?
hu_hu: A fájlátvitel folyamatban van. Biztos, hogy kilépsz?
it: E' in corso un lavoro. Uscire ugualmente?
pt_br: Transferência de arquivo em andamento. Sair mesmo assim?
sk_sk: Prebieha prenos súboru. Napriek tomu ukončiť?
zh_tw: 正在進行文件傳輸。 還是要退出嗎？

# StepSliderToolTip
source: Step:
cs_cz: Kroky:
de: Schritt:
es: Paso:
it: Passo:
pt_br: Passo:
zh_tw: 移動距離(mm)：

# BoxConfigDetectedChanges
source: There are some changes that have not been applied. Do you want to rewrite the configuration?
cs_cz: Existují některé změny, které nebyly použité. Chcete přepsat konfiguraci?
de: Es gibt einige Änderungen, die nicht angewandt wurden. Möchten Sie die Konfiguration neu schreiben?
es: Hay algunos cambios que no han sido aplicados. ¿Quieres reescribir la configuración?
hu_hu: Vannak olyan módosítások, amelyeket nem alkalmaztak. Felül szeretné írni a konfigurációt?
it: Alcuni cambiamenti non sono stati applicati. Si desidera scrivere la configurazione?
pt_br: Existem algumas alterações que não foram aplicadas. Deseja reescrever a configuração?
sk_sk: Existujú niektoré zmeny, ktoré neboli použité. Chcete prepísať konfiguráciu?
zh_tw: 有一些尚未應用的更改。 您要重寫設置嗎？

# BtnDisconnectTT
source: Disconnect
cs_cz: Odpojit
de: Verbindung trennen
es: Desconectar
it: Disconnetti
pt_br: Desconectar
zh_tw: 斷開

# ResumeJobHomingRequired
source: It seems that the current position is no longer known by Grbl. Without the Homing Procedure ($H) the result may not be reliable. Continue anyway?
cs_cz: Zdá sa, že Grbl už nezná současnou pozici. Bez procedury Domů ($H) nemusí být výsledek spolehlivý. Přesto pokračovat?
de: Es scheint, dass Grbl die aktuelle Position nicht mehr bekannt ist. Ohne das Homing-Verfahren ($H) ist das Ergebnis möglicherweise nicht zuverlässig. Trotzdem weitermachen?
es: Al parecer la posición actual no es reconocida por Grbl. Sin el procedimiento de volver al punto de partida ($H) el resultado puede ser no deseado. ¿Continuar de todas maneras?
hu_hu: Úgy tűnik, hogy Grbl már nem ismeri a jelenlegi helyzetet. Home eljárás nélkül ($ H) az eredmény nem biztos, hogy megbízható. Mindenképp folytatni?
it: Sembrerebbe che Grbl abbia perso la posizione corrente. Senza procedura di Homing ($H) il risultato potrebbe essere impredicibile. Continuare ugualmente?
pt_br: Parece que a posição atual não é mais conhecida pelo Grbl. Sem o Procedimento de Início (Homing Procedure) ($H), o resultado pode não ser confiável. Continue de qualquer maneira?
sk_sk: Zdá sa, že už nepozná súčasnú pozíciu. Bez príkazu domov ($H) nemusí byť výsledok spoľahlivý. Napriek tomu pokračovať?
zh_tw: 顯然，Grbl無法識別當前位置。 如果沒有返回起始點 ($H) 的過程，有可能是不預期的結果。 還是繼續嗎？

# BoxImportCustomButtonClearText
source: Remove actual buttons? Select yes to remove, no to keep.
cs_cz: Odstranit aktuální tlačítka? ANO pro odstranění, NE pro ponechání.
de: Aktuelle Schaltflächen entfernen? Wählen Sie Ja zum Entfernen, Nein zum Behalten.
es: ¿Remover botón actual? Selecciona Sí para remover, No para mantener.
hu_hu: Eltávolítja az akutális gombokat? Válassza az igen lehetőséget az eltávolításhoz, a nem-et a megtartáshoz.
it: Eliminare i pulsanti correnti? Si per rimuovere, no per mantenere.
pt_br: Remover botões atuais? Selecione sim para remover, não para manter.
sk_sk: Odstrániť aktuálne tlačidla? ANO pre odstránenie, NIE pre ponechanie.
zh_tw: 刪除當前按鈕？ 是，刪除，不保留。

# BtnConnectTT
source: Connect
cs_cz: Připojit
de: verbinden
es: Conectar
it: Connetti
pt_br: Conectar
zh_tw: 連接

# UnsupportedFiletype
source: This file type is not supported.
cs_cz: Tento typ souboru není podporován.
de: Dieser Dateityp wird nicht unterstützt.
es: Este archivo no está soportado.
it: Il file non è supportato
pt_br: Este tipo de arquivo não é suportado
zh_tw: 不支持該文件。

# BoxWriteConfigWithError
source: {0} Config written with {1} errors!
cs_cz: {0} Konfigurace uložena s {1} chybami!
de: {0} Konfiguration mit {1} Fehlern geschrieben!
es: {0} Configuración escrita con {1} errores!
hu_hu: {0} konfiguráció kiírva {1} hibával!
it: Ho scritto {0} valori con {1} errori!
pt_br: {0} Configuração gravada com {1} erros!
sk_sk: {0} Konfigurácia uložená s {1} chybami!
zh_tw: {0} 配置保存有錯誤 {1}!

# BoxConfigDetectedChangesTitle
source: Changes detected!
cs_cz: Zjištěné změny
de: Änderungen entdeckt!
es: Cambios detectados!
hu_hu: A változások észlelve!
it: Rilevata una variazione!
pt_br: Mudanças detectadas!
sk_sk: Zistené zmeny
zh_tw: 檢測到更改！

# WarnMessageBoxHeader
source: Warning
cs_cz: Upozornění
de: Warnung
es: Alerta
it: Attenzione
pt_br: Aviso
